import 'package:flutter/material.dart';
import 'package:share_plus/share_plus.dart';
class UrduReadingPage extends StatefulWidget {
  final String category;
  const UrduReadingPage({super.key, required this.category});

  @override
  State<UrduReadingPage> createState() => _UrduReadingPageState();
}
class _UrduReadingPageState extends State<UrduReadingPage> {
  final List<String> category = [
    'Birth And Childhood',
    'Makki Life',
    'Madni Life',
    'Parents',
    'Wives',
    'Children',
    'Miracles',
    'Battles',
  ];
  final List<String> birthAndChildhoodHeadings = [
    'مکہ میں پیدائش',
    'یتیمی',
    'نگراں',
    'بچپن',
    'خصلتیں اور صفات',
    'الہی مداخلت',
    'نبوت کی ابتدائی نشانیاں',
    'ماں کی آغوشِ محبت میں'
  ];
  final List<String> makkiLifeHeadings = [
    'ابتدائی زندگی اور نبوت کا بلاوا',
    'جدوجہت اور ظلم: دباؤ میں ایک نبی',
    'اسلام کی ترقی: مکہ کی سرزمین میں ایمان کے بیج',
    'مکہ کا دور: آزمائشوں میں استقامت اور بنیادوں کی تعمیر',
  ];
  final List<String> madniLifeHeadings = [
    'اسلام کی مضبوطی: نئے دور کا آغاز (رحیق المختوم)',
    'ایک خطرناک سفر: ہجرت (رحیق المختوم)',
    'نئے مقدس گھر کی تعمیر: مدینہ اور اسلام کا عروج (رحیق المختوم)',
    'دفاعی جنگیں: عقیدے کی حفاظت (رحیق المختوم)',
    'خندق کی لڑائی: حکمتِ عملی کا مظاہرہ (رحیق المختوم)',
    'حدیبیہ کا معاہدہ: سفارتی فتح (رحیق المختوم)',
    'خیبر کی مہم: خطرے کا خاتمہ (رحیق المختوم)',
    'عمرہ فتح: ایک پر امن واپسی (رحیق المختوم)',
    'حجة الوداع: آخری پیغام (رحیق المختوم)',
    'نبی اکرم ﷺ کی میراث: ایک ہمیشہ برقرار رہنے والا پیغام (رحیق المختوم)',
  ];
  final List<String> parentsHeadings = [
    'حضرت محمد ﷺ کے والد: عزت اور فضیلت کی میراث\n\nاقتدار اور احترام کی جڑیں',
    'غیر معمولی کردار کا مالک',
    'ایک مختصر اتحاد جسے حادثے نے ختم کر دیا',
    'حضرت محمد ﷺ کی والدہ: ابتدائی زندگی میں طاقت کا ستون\n\nنبوی خاندان کی جڑیں',
    'ایک قابل ذکر شخصیت کی جھلکیاں',
    'غم کے وقت میں نگہداشت کا سہارا',
    'طاقت اور ایمان کی میراث',
  ];
  final List<String> wivesHeadings = [
    'حضرت خدیجہ بنت خویلد (رضی اللہ تعالیٰ عنها) : طاقت اور حمایت کا ستون',
    'حضرت سودہ بنت زمعہ (رضی اللہ تعالیٰ عنها) : خاموش طاقت کی حامل بیوی',
    'حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها) : ایک عالمہ اور علم کی محافظ',
    'حضرت حفصہ بنت عمر (رضی اللہ تعالیٰ عنها) : خاندانوں کے درمیان ایک پل',
    'زینب بنت خزيمہ (رضي الله عنها) : ایک رازوں سے بھری زندگی',
    'زینب بنت خزيمہ (رضي الله عنها) : ایک رازوں سے بھری زندگی',
    'ہند بنت ابی امیا (رضي الله عنها) ، جسے ام سلمہ بھی کہا جاتا ہے : حکمت اور لچکدار عورت',
    'زینب بنت جحش (رضي الله عنها) : ایک نکاح اور ایک وحی',
    'جويرية بنت الحارث (رضي الله عنها) : ایک لڑکی قیدی سے ایک بیوی تک',
    'ميمونہ بنت الحارث (رضي الله عنها) : بڑھاپے میں راحت کا سہارا',
    'صفیہ بنت حیی (رضي الله عنها) : برادری کے درمیان ایک پل',
    'رملة بنت ابو سفيان (رضي الله عنها)، ام حبيبة : ایمان اور سفارت کا سفر',
  ];
  final List<String> childrenHeadings = [
    'حضرت محمد صلی اللہ علیہ وسلم کی اولاد',
    'بیٹے\n\nقاسم بن محمد صلی اللہ علیہ وسلم',
    'عبداللہ بن محمد صلی اللہ علیہ وسلم',
    'ابراہیم بن محمد صلی اللہ علیہ وسلم',
    'بیٹیاں\n\nزینب بنت محمد صلی اللہ علیہ وسلم (598/599-629 عیسوی)',
    'رقیہ بنت محمد صلی اللہ علیہ وسلم 601 تا مارچ 624',
    'ام کلثوم بنت محمد صلی اللہ علیہ وسلم (603-630 عیسوی)',
    'فاطمہ بنت محمد صلی اللہ علیہ وسلم (605/15-632 عیسوی)',
  ];
  final List<String> birthAndChildhoodUrduText = [
    'رسول اللہ ﷺ مکہ میں شعب بنی ہاشم کے اندر ۹ ربیع الاول سالہ ولادت با سعادت عام الفیل یوم دوشنبہ کو صبح کے وقت پیدا ہوئے ۔ اس وقت نوشیرواں کی تخت نشینی کا چالیسواں سال تھا اور ۲۰ یا ۲۲ اپریل ۶۵۷ کی تاریخ تھی ۔ علامہ محمد سلیمان صاحب سلمان منصور پوری اور محمود پاشا فلکی کی تحقیق یہی ہے۔\n\nابن سعد کی روایت ہے کہ رسول اللہ صلے کی والدہ نے فرمایا :\u2000 جب آپ کی ولادت ہوئی تو میرے جسم سے ایک نور نکلا جس سے ملک شام کے محل روشن ہوگئے ۔ امام احمد نے حضرت عرباض بن ساریہ سے بھی تقریباً اسی مضمون کی ایک روایت نقل فرمائی ہے.\n\nبعض روایتوں میں بتایا گیا ہے کہ ولادت کے وقت بعض واقعات نبوت کے پیش خیمے کے طور پر ظہور پذیر ہوئے، یعنی ایوان کسری کے چودہ کنگورے گر گئے ۔ مجوس کا آتش کدہ ٹھنڈا ہو گیا۔ بحیرہ سادہ خشک ہوگیا اور اس کے گرجے منہدم ہو گئے ۔ یہ بیہقی کی روایت ہے.\n\nولادت کے بعد آپ کی والدہ نے عبدالمطلب کے پاس پوتے کی خوشخبری بھجوائی۔ وہ شاداں و فرحاں تشریف لائے اور آپ کو خانہ کعبہ میں لے جا کہ اللہ تعالی سے دعا کی ، اس کا شکر ادا کیا اور آپ کا نام محمد تجویز کیا ۔ یہ نام عرب میں معروف نہ تھا۔ پھر عرب دستور کے مطابق ساتویں دن ختنہ کیا.\n\nآپ کو آپ کی والدہ کے بعد سب سے پہلے ابو لہب کی لونڈی ودینیہ نے دودھ پلایا۔ استقرت اس کی گود میں جو بچہ تھا اس کا نام مسروح تھا ۔ تویہ نے آپ سے پہلے حضرت حمزہ بن عبد المطلب کو اور آپ کے بعد ابو سلمہ بن عبدالاسد محرومی کو ھی دودھ پلایا تھا۔\n',
    ' محمد صلی اللہ علیہ وسلم کو کم عمری میں اپنے والدین دونوں کی کمی کا سامنا کرنا پڑا، جس نے ان کی پرورش پر گہرا اثر ڈالا۔ ان کے والد عبداللہ، ان کی پیدائش سے پہلے ہی انتقال کر گئے تھے، جس سے وہ شروع سے ہی یتیم ہو گئے تھے۔ محمد صلی اللہ علیہ وسلم کی والدہ آمنہ نے اپنے ابتدائی سالوں میں ان کی دیکھ بھال کی لیکن وہ بھی اس وقت چل بسیں جب وہ صرف چھ سال کے تھے۔ والدین کی شخصیت کے اس دوہرے نقصان نے محمد صلی اللہ علیہ وسلم کو یتیم بنا دیا، اور ان چیلنجوں کی نشاندہی کرتا ہے جن کا انہیں کم عمری سے ہی سامنا تھا۔ تاہم، یتیمی کے اس تجربے نے اس میں ہمدردی، لچک اور کم نصیبوں کے لیے ہمدردی پیدا کی، جس سے اس کے کردار کی نشوونما ہوئی۔\n',
    ' اپنی والدہ کی وفات کے بعد، محمد صلی اللہ علیہ وسلم کو ان کے دادا عبدالمطلب کی دیکھ بھال سونپ دیا گیا، جو مکہ میں ایک قابل احترام رہنما تھے۔ عبدالمطلب نے اپنے ابتدائی سالوں میں محمد صلی اللہ علیہ وسلم کو والدین کی رہنمائی اور پیار فراہم کیا۔ تاہم، محمد صلی اللہ علیہ وسلم کے دادا کا انتقال اس وقت ہوا جب وہ آٹھ سال کے تھے۔ اس کے بعد، محمد صلی اللہ علیہ وسلم اپنے چچا ابو طالب کی سرپرستی میں آگئے، جنہوں نے ان کی پرورش اور حفاظت کی ذمہ داری قبول کی۔ ابو طالب نے محمد صلی اللہ علیہ وسلم کی زندگی میں ایک اہم کردار ادا کیا، مختلف آزمائشوں اور فتنوں میں ان کی مدد کی، بشمول ان کی نبوت کے ابتدائی سال۔\n',
    'حضرت محمد صلی اللہ علیہ وسلم کا بچپن الہی نعمتوں اور معجزاتی واقعات سے نشان زد تھا، جو بچپن سے ہی ان کی خصوصی حیثیت کی عکاسی کرتا ہے۔ اس کے یتیم ہونے کی وجہ سے ابتدائی طور پر دوسری خواتین کی طرف سے مسترد کیے جانے کے باوجود، بالآخر اسے حلیمہ بنت ابی ذوائب نے منتخب کیا، جس نے اسے اپنی نگہداشت میں لے جانے پر قسمت کی تبدیلی کا تجربہ کیا۔ اس کی سرپرستی میں، محمد (صلی اللہ علیہ وسلم) نے اس کے گھر والوں کے لیے بے شمار برکتیں لائیں، جن میں دودھ کی غیر متوقع دستیابی اور ان کے جانوروں اور اردگرد کے ماحول کی بحالی بھی شامل ہے۔\n\nاس دور نے ایک گہرا واقعہ بھی دیکھا جہاں فرشتہ جبرائیل محمد (صلی اللہ علیہ وآلہ وسلم) کے پاس آیا، ان کے دل کو صاف کیا اور انہیں اللہ کے رسول کے طور پر اپنے مستقبل کے کردار کے لیے تیار کیا۔ اپنے آس پاس کے لوگوں کے ابتدائی صدمے اور تشویش کے باوجود، محمد (صلی اللہ علیہ وسلم) بغیر کسی نقصان کے ابھرے، ان کا چہرہ پاکیزگی سے چمک رہا تھا۔\n\nیہ واقعات پیغمبر اسلام (ص) کی ابتدائی زندگی کے ارد گرد الہی تحفظ اور رہنمائی کو اجاگر کرتے ہیں، انسانیت کے مستقبل کی تشکیل میں ان کے اہم کردار کی پیشین گوئی کرتے ہیں۔ الہی مداخلت اور حلیمہ کی دیکھ بھال کے ذریعے، ان کے ابتدائی سال برکتوں اور معجزات سے بھرے ہوئے تھے، جس نے اسلام کے آخری پیغمبر کے طور پر ان کے غیر معمولی سفر کی بنیاد رکھی۔\n',
    ' نبی اکرم صلی اللہ علیہ وسلم کی مکی زندگی کے نمایاں پہلوؤں میں سے ایک مصیبت کے وقت آپ کا صبر، ہمدردی اور معافی ہے۔ ان کے ساتھ ہونے والے ناروا سلوک کے باوجود، اس نے کبھی بھی اپنے دشمنوں کے خلاف بدتمیزی نہیں کی اور ہمیشہ مفاہمت اور بات چیت کے مواقع تلاش کرتے رہے۔ \n\nنبیﷺ اپنی قوم میں شیریں کردار ، فاضلانہ اخلاق اور کریمانہ عادات کے لحاظ سے ممتاز تھے۔ چنانچہ آپ سب سے زیادہ با مروت ، سب سے خوش اخلاق ، سب سے معزز ہمسایہ سب سے بڑھ کر دور اندیش ، سب سے زیادہ راست گو سب سے زم پہلو سب سے زیادہ پاک نفس ، خیر میں سب سے زیادہ کریم ، سب سے نیک عمل ، سب سے بڑھ کہ پابند عہد اور سب سے بڑے امانت دار تھے ، حتی کہ آپ کی قوم نے آپ کا نام ہی امین رکھ دیا تھا کیونکہ آپ احوال صالحہ اور خصال حمیدہ کا پیکر تھے۔ اور جیسا کہ حضرت خدیجہ کی شہادت ہے آپ نے درماندوں کا بوجھ اٹھاتے تھے ، تہی دستوں کا بندوبست فرماتے تھے ، مہمان کی میزبانی کرتے تھے اور مصائب حق میں اعانت فرماتے تھے نیلے۔\n',
    ' اسلامی روایت محمد صلی اللہ علیہ وسلم کے بچپن میں پیش آنے والے کئی معجزاتی واقعات کا ذکر کرتی ہے، جو ان کی خصوصی حیثیت کی الہی نشانیوں کے طور پر کام کرتے ہیں۔ ایسے ہی ایک واقعہ میں فرشتہ جبرائیل (جبریل) کا دورہ شامل ہے، جو محمد صلی اللہ علیہ وسلم کے سامنے ظاہر ہوا اور اس کے دل کو پاک کیا، جو کہ ایک نبی کے طور پر ان کے مستقبل کے کردار کی تیاری کی علامت ہے۔ اس الہی مداخلت نے محمد صلی اللہ علیہ وسلم کے روحانی سفر کا آغاز کیا اور انہیں الہی علم اور بصیرت عطا کی۔\n',
    ' اسلامی ذرائع کے مطابق، محمد صلی اللہ علیہ وسلم کی آئندہ نبوت کی نشاندہی کرنے والی نشانیاں ان کی زندگی کے اوائل میں ظاہر ہوئیں۔ ان نشانیوں میں سے فرشتہ جبرائیل کی طرف سے اس کے سینے کا معجزانہ طور پر پھٹ جانا تھا، جس نے نجاست کو دور کیا اور اس کے دل پر ایمان کی مہر لگا دی۔ یہ غیر معمولی واقعہ محمد صلی اللہ علیہ وسلم کی روح کی تزکیہ اور تقدیس کی علامت ہے جو اسلام کے آخری رسول کے طور پر ان کے الہی مشن کی تیاری میں تھا۔ نبوت کی ان نشانیوں نے انسانیت کے لیے خدا کے پیغام کے علمبردار کے طور پر محمد صلی اللہ علیہ وسلم کی منفرد حیثیت اور مشن کی تصدیق کی۔\n',
    'اس واقعے کے بعد حلیمہ کو خطرہ محسوس ہوا اور انہوں نے آپ کو آپکی ماں کے حوالے کر دیا ۔ چنانچہ آپ چھ سال کی عمر تک والدہ ہی کی آغوش محبت میں رہے۔  ادھر حضرت آمنہ کا ارادہ ہوا کہ وہ اپنے متوفی شوہر کی یاد وفا میں شرب جا کر ان کی قبر کی زیارت کریں۔ چنانچہ وہ اپنے یتیم بچے محمدﷺ نے اپنی خادمہ ام ایمن اور اپنے سرپرست عبدالمطلب کی معیت میں کوئی پانچ سو کیلومیٹر کی مسافی طے کر کے مدینہ تشریف لے گئیں اور وہاں ایک ماہ تک قیام کر کے واپس ہوئیں، لیکن ابھی ابتداء راہ میں تھیں کہ بیماری نے آلیا۔ پھر یہ بیماری شدت اختیار کرتی گئی یہاں تک کہ مکہ اور مدینہ کے درمیان مقام ابواء میں پہنچ کر رحلت کرگئیں۔\n',
  ];
  final List<String> makkiLifeUrduText = [
    'اخلاقیات اور اعتماد کی بنیاد:\u2000نبی اکرم ﷺ ایک ایسے معاشرے میں پیدا ہوئے جو قبائلی رقابت اور بت پرستی میں ڈوبا ہوا تھا۔ لیکن کم عمری سے ہی آپ ﷺ نے انوکھے اوصاف کا مظاہرہ کیا جو انہیں دوسروں سے ممتاز کرتے تھے۔ نبوت ملنے سے پہلے ہی آپ ﷺ اپنی سچائی اور دیانتداری کے باعث صادق (سچے) اور امین (ایماندار) کے لقب سے جانے جاتے تھے۔ لوگ آپ ﷺ کو اپنی قیمتی چیزیں سونپتے تھے اور آپ ﷺ کے منصفانہ فیصلوں کے لیے آپ ﷺ سے مشورہ کرتے تھے۔ آپ ﷺ کا یہ بے داغ کردار مکہ والوں پر بہت اثر رکھتا تھا، جو اکثر تنازعات میں آپ ﷺ سے ثالثی کا مطالبہ کرتے تھے۔\n\nتنہائی اور روحانی تلاش: \u2000 جیسے جیسے نبی اکرم ﷺ بڑے ہوتے گئے، آپ ﷺ میں غور وفکر اور روحانی جستجو کا احساس بڑھتا گیا۔ آپ ﷺ کو خاموشی کے ساتھ غور و فکر کرنے میں سکون ملتا تھا، اور اکثر مکہ کے قریب ایک پہاڑی غار، حرا، میں تنہائی اختیار کر لیتے تھے۔ یہاں آپ ﷺ راتوں کو نماز اور مراقبے میں گزارتے، اپنے لوگوں اور اپنے آس پاس کی دنیا کے بارے میں غور کرتے تھے۔\n\nعظیم الشان وحی: \u2000 چالیس سال کی عمر میں، آپ ﷺ کی زندگی بدل دینے والا واقعہ پیش آیا۔ حرا غار میں اسی طرح کی ایک تنہائی کے دوران، آپ ﷺ کا فرشتہ جبرائیل علیہ السلام سے سامنا ہوا۔ اسلامی روایت اس ملاقات کو حیرت انگیز اور خوفناک دونوں بتاتی ہے۔ فرشتہ جبرائیل علیہ السلام نے قرآن کی پہلی آیات کا انکشاف کیا، جو اللہ تعالیٰ کا ایک الہیٰی پیغام تھا۔ یہ واقعہ نبی اکرم ﷺ پر گہرا اثر چھوڑ گیا، اور آپ ﷺ کی نبوت کا آغاز ہوا۔\n\nتوحید کا بلاوا: \u2000 پہلی وحیوں کا مرکز اسلام کا بنیادی اصول، توحید، یعنی اللہ تعالیٰ کی مطلق وحدانیت تھا۔ یہ آیات مکہ میں موجود بت پرستی کی عام روایت کو واضح طور پر مسترد کرتی تھیں، جہاں لوگ متعدد دیوتاؤں اور بتوں کی پوجا کرتے تھے۔ یہ پیغام لوگوں کو شرک کو ترک کرنے اور صرف اور اکلوتا خدا، اللہ تعالیٰ کی عبادت کی طرف رجوع کرنے کی ترغیب دیتا تھا۔\n\nتوحید کا یہ بلاوا نبی اکرم ﷺ کی تعلیمات کا سنگ بنیاد بنا اور مکہ کے معاشرے کی بنیاد کو ہی چیلنج کر دیا۔ اس نے ان لوگوں کے اقتصادی مفادات کو خطرے میں ڈال دیا جو بت پرستی سے فائدہ اٹھاتے تھے اور خانہ کعبہ کے گرد قائم سماجی نظام کو بھی چیلنج کر دیا، جو مختلف بتوں کا گھر تھا۔ جیسے جیسے وحی کا سلسلہ جاری رہا، اس میں سماجی عدل، رحم اور نیک اعمال جیسے موضوعات پر مزید گہرائی سے بات کی گئی، جو ایک نئے طرز زندگی کی بنیاد رکھ رہے تھے۔\n',
    'اسلام کا پیغام، جس میں توحید پر زور دیا گیا تھا، مکہ کے معاشرے کے اصل جوہر کو للکار رہا تھا۔ قریش کا طاقتور قبیلہ، خانہ کعبہ کا نگہبان اور اور بتوں سے بھرے ہوئے مقدس مقام کی زیارت پر مبنی مکہ کی معاشی خوشحالی کا محافظ، اپنے طریق زندگی کو خطرے میں دیکھ رہا تھا۔\n\nتمسخر اور دھمکیوں کا سامنا: \u2000 بت پرستی کے خلاف نبی اکرم ﷺ کے اعلانات کو نا یقینی، استہزاء اور گالیوں کا سامنا کرنا پڑا۔ قریش کے اعلیٰ طبقے نے آپ ﷺ کو پاگل، کاہن یا شاعر قرار دے کر مضحکہ اڑایا۔ انہوں نے آپ ﷺ کے بارے میں افواہیں پھیلائیں اور آپ ﷺ کے کردار پر بھونڈا چڑھایا، جس کا مقصد آپ ﷺ کے پیغام کو بدنام کرنا اور لوگوں کو آپ ﷺ کے خلاف کرنا تھا۔ دھمکیاں اور جسمانی نقصان عام بات ہو گئی۔ نبی اکرم ﷺ اور آپ ﷺ کے پیروکاروں کا با مقاطعہ کیا گیا، ان کی روزیوں کو خطرہ لاحق ہو گیا اور ان کے سماجی مقام کو نقصان پہنچا۔\n\nمعاشی بائیکاٹ اور سماجی تنہائی: \u2000 قریش نے اپنی ستم ظریفی کو اس وقت بڑھا دیا جب انہوں نے بنو ہاشم، جس قبیلے سے نبی اکرم ﷺ تعلق رکھتے تھے، پر سخت معاشی اور سماجی بائیکاٹ مسلط کر دیا۔ اس کا مطلب یہ تھا کہ تجارت اور سماجی رابطے سے مکمل طور پر علیحدگی تھی۔ قبیلے کو خوراک اور دیگر ضروریات زندگی سے بھی انکار کر دیا گیا تھا، اور انہیں سخت حالات میں مکہ کے باہر ایک وادی میں رہنے پر مجبور کر دیا گیا تھا۔ اس حربے کا مقصد بنو ہاشم پر دباؤ ڈالنا تھا کہ وہ نبی اکرم ﷺ کی حفاظت ترک کر دیں اور آپ ﷺ کے پیغام کو خاموش کر دیں۔\n\nایک کمزور سپر: \u2000 ستم ظریفی کے باوجود، بنو ہاشم نے ابتداء میں نبی اکرم ﷺ کو کچھ تحفظ فراہم کیا، جو قبائلی وفاداری اور آپ ﷺ کے احترام کی بنا پر تھا۔ لیکن، یہ سپر بغیر دراڑوں کے نہیں تھا۔ بائیکاٹ کی وجہ سے ہونے والی معاشی مشکلات نے قبیلے کے اندر تعلقات کو کشیدہ کر دیا۔ کچھ غیر مسلم ممبران جو دکھ سہتے ہو رہے تھے، وہ قبائلی قیادت پر دباؤ ڈالنے لگے کہ وہ امن کی خاطر نبی اکرم ﷺ کو خاموش کرنے پر غور کریں۔\n\nنبی اکرم ﷺ اور آپ ﷺ کے پیروکاروں نے اس دور کو غیر معمولی صبر اور استقامت کے ساتھ برداشت کیا۔ انہوں نے اپنے ایمان میں تسلی پائی اور مشکل حالات میں ایک دوسرے کی مدد کی۔ تاہم، بنو ہاشم پر پڑنے والے دباؤ اور قریش کے مسلسل ظلم نے آخر کار انہیں مکہ سے باہر پناہ لینے پر مجبور کر دیا۔\n',
    'انفرادی طور پر سننے والی صدا: \u2000 شدید مخالفت کا سامنا کرنے کے باوجود، نبی اکرم ﷺ نے مکہ کے دور میں بھی اسلام کا پیغام پھیلانا جاری رکھا۔ توجہ انفرادی طور پر لوگوں کو مسلمان بنانے پر تھی۔ آپ ﷺ لوگوں سے بات چیت کرتے اور توحید (اللہ تعالیٰ کی وحدانیت) کے مرکزی پیغام اور ایک نیک زندگی گزارنے کی اہمیت پر زور دیتے تھے۔ آپ ﷺ لوگوں کی عقل اور منطق کو مخاطب کرتے اور انہیں اللہ تعالیٰ کی تخلیق کی نشانیوں اور بتوں کی پوجا کی بے معنیٰ ہونے پر غور کرنے کی ترغیب دیتے تھے۔\n\nیہ طریقہ کار ان لوگوں کے لیے باعث کشش بنا جسوں نے اسلام کی سادگی اور پاکیزگی کو قبول کیا۔ انہیں سماجی انصاف، غریب اور کمزوروں کے لیے رحم، اور صرف ایک سچے خدا کی عبادت پر مبنی زندگی کے پیغام میں سکون ملا۔ مسلمانوں کی تعداد اگرچہ ابتدائی طور پر کم تھی، لیکن وہ ایک مضبوط کمیونٹی بنا چکے تھے، جو اپنے مشترکہ عقیدے اور نبی اکرم ﷺ کے پیغام کے تئیں پختہ عہد سے جڑے ہوئے تھے۔\n\nرشتہ داری میں پناہ: \u2000 ستم ظریفی کے باوجود، نبی اکرم ﷺ مکہ کے اندر کچھ بااثر خاندانوں اور افراد کی حمایت حاصل کرنے میں کامیاب ہو گئے۔ خاص طور پر، آپ ﷺ کی بیوی خدیجہ بنت خویلد، جو ایک کامیاب بزنس وومن تھیں، آپ ﷺ کی ابتدائی اور سب سے مضبوط حامیوں میں سے ایک تھیں۔ ان کے پختہ ایمان اورمالی تعاون نے بائیکاٹ کے مشکل دور میں نئےمسلم کمیونٹی کی بڑی مدد کی۔\n\nنبی اکرم ﷺ کے خاندان کے دیگر افراد، جیسے آپ ﷺ کے چچا ابو طالب، اگرچہ خود مسلمان نہ ہوئے، لیکن انہوں نے قبائلی تعلقات اور عزت کے جذبے کی بنا پر آپ ﷺ کو تحفظ فراہم کیا۔ اس محدود تحفظ نے ابھی ابھی وجود میں آنے والی مسلم کمیونٹی کو سانس لینے کی گنجائش دے دی۔\n',
    'نبی اکرم ﷺ کی زندگی کا مکہ کا دور مشکلات اور استقامت کا کسوٹی تھا۔ یہ دور ایمان کی طاقت اور بنیادی اقدار کی اہمیت کا گواہ ہے جو آج بھی مسلمانوں کے لیے معنی رکھتا ہے۔\n\nصبر اور استقامت کے ذریعے طاقت حاصل کرنا: \u2000 مکہ میں رہنے کے دوران نبی اکرم ﷺ اور ان کے پیروکاروں کو مسلسل ظلم و ستم کا سامنا کرنا پڑا۔ ان کا تمسخر اُڑایا گیا، ان کا سماجی بائیکاٹ کیا گیا، انہیں معاشی مشکلات کا سامنا کرنا پڑا، بلکہ انہیں تشدد کی دھمکیاں بھی دی گئیں۔ لیکن، انہوں نے ان آزمائشوں کو غیر معمولی صبر اور استقامت کے ساتھ برداشت کیا۔ وہ اپنے عقائد پر مضبوط رہے اور شدید دباؤ کے باوجود اپنے ایمان پر کوئی سمجھوتا کرنے سے انکار کر دیا۔ یہ پختہ عہد مسلمانوں کے لیے ایک اہم سبق ہے، جو انہیں مشکل حالات میں بھی اپنے عقائد پر مضبوط رہنے کی تلقین کرتا ہے۔\n\nسچائی اور عدل پر قائم بنیاد: \u2000 مکہ میں نازل ہونے والی وحیوں نے اسلام کے بنیادی اصولوں کی بنیاد رکھی۔ توحید کا پیغام، یعنی اللہ تعالیٰ کی مطلق وحدانیت، ایمان کا بنیادی پتھر ہے۔ ابتدائی وحیوں میں نیک اعمال، کم نصیب لوگوں کے لیے رحم، اور سچائی اور عدل کا پرچارک کرنے پر زور دیا گیا۔ یہ اقدار مذہبی حدود سے بلند ہیں اور ان لوگوں کے لیے باعث کشش ہیں جو ایک زیادہ منصفانہ اور مساویانہ معاشرے کے خواہشمند ہیں۔ مکہ کے دور نے وہ اخلاقی فریم ورک قائم کیا جس نے آنے والے سالوں میں مسلم کمیونٹی کی رہنمائی کی۔\n\nجدوجہت سے امید کی طرف:\u2000 نئی کمیونٹی کی بنیاد رکھنا: ستم ظلم کے باوجود، مکہ کا دور بغیر کسی کامیابی کے نہیں تھا۔ ایمان کے بیج ان لوگوں کے دلوں میں بویے گئے جنہوں نے نبی اکرم ﷺ کے پیغام میں سچائی کو تسلیم کیا۔ اس دور میں وجود میں آنے والی چھوٹی لیکن عقیدت مند مسلم کمیونٹی نے مستقبل کی ترقی کی بنیاد رکھی۔ عقبہ کا پہلا بیعت، جہاں یثرب کے ایک گروپ نے اسلام کے ساتھ وفاداری کا عہد کیا، اس نے مظلوم مسلمانوں کے لیے ایک نئی امید اور محفوظ پناہ گاہ کی پیشکش کی۔ اس واقعے نے ایک اہم موڑ کا کام کیا اور مدینہ کی طرف ہجرت کی راہ ہموار کی – جو بعد ازاں پہلی اسلامی ریاست کے قیام اور اسلام کی ترقی کا باعث بنی۔\n\nمکہ کا دور ایک زبردست یاد دہانی ہے کہ مشکلات کے درمیان بھی، ایمان اور استقامت ایک روشن مستقبل کی بنیاد رکھ سکتے ہیں۔ اس مشکل دور کے دوران سیکھے گئے اسباق آج بھی دنیا بھر کے مسلمانوں کی رہنمائی اور ترغیب کا باعث بنے ہوئے ہیں۔\n',
  ];
  final List<String> madniLifeUrduText = [
    'مکہ میں ظلم و ستم کی آگ میں تپ کر، نبی اکرم ﷺ اور ابتدائی مسلم کمیونٹی کو بے پناہ مشکلات کا سامنا کرنا پڑا۔ یہ وہ دور تھا جب مشرکینِ قریش مسلسل دشمنی اور سماجی بائیکاٹ کے ذریعے اسلام کی روشنی کو بجھانے کی کوشش میں تھے۔ اپنے معاشی اور سماجی نظام کو بت پرستی کے گرد بنائے ہوئے قریشِ مکہ، اسلام کے پیغام سے خوفزدہ تھے جو ان کے اقتدار کو چیلنج کر رہا تھا۔ لیکن، ان تمام مشکلات کے باوجود، ایک کرن امید افق پر جگمگائی۔\n\nپہلا بیعت عقبہ: ایک نئی منزل کا آغاز:\u2000سنہ 621 عیسوی میں، مکہ کے شمال میں واقع شہر یثرب سے ایک وفد سالانہ حج کے لیے آیا۔ قریش کو خبر نہ تھی کہ یہ لوگ اسلام کے پیغام سے متاثر ہو چکے ہیں۔ حضور اکرم ﷺ کی تعلیمات اور آپ کے کردار سے متاثر ہو کر، ان لوگوں نے رات کے وقت آپ سے خفیہ ملاقات کی۔ اس خفیہ ملاقات کا نتیجہ ایک تاریخی واقعہ، پہلا بیعت عقبہ کی صورت میں نکلا۔\n\nپہلا بیعت عقبہ نے اسلامی تاریخ میں ایک نئے دور کا آغاز کیا۔ یثرب سے آئے ہوئے بارہ نمائندوں کے ایک گروپ نے اسلام قبول کیا اور نبی اکرم ﷺ اور مسلمانوں کو ظلم و ستم سے بچانے کا عہد کیا۔ یہ مظلوم مسلمانوں کے لیے ایک جرات مندانہ قدم تھا اور مکہ میں ان کے لیے ایک محفوظ پناہ گاہ کی امید پیدا ہو گئی۔\n',
    'پہلے بیعت عقبہ کی خبر سن کر قریش غضبناک ہو گئے۔ وہ اسلام کے بڑھتے ہوئے اثر اور مکہ پر اپنی گرفت کمزور ہونے سے ڈر رہے تھے۔ جب انہیں نبی اکرم ﷺ کو قتل کرنے کی سازش کا علم ہوا تو مسلمان جانتے تھے کہ انہیں مکہ چھوڑنا پڑے گا۔ اس طرح ہجرت کا تاریخی سفر شروع ہوا۔\n\nسنہ 622 عیسوی میں، نبی اکرم ﷺ اور آپ کے ساتھی ایک مشکل سفر پر روانہ ہوئے، مکہ سے یثرب کی طرف۔ اپنے گھر بار اور اپنی زندگیاں پیچھے چھوڑ کر، انہوں نے یہ سفر، ایک نئی شروعات کی توقع اور پختہ ایمان کے ساتھ کیا۔ ہجرت صرف جغرافیائی تبدیلی نہیں تھی، یہ اسلامی تاریخ کے نئے دور کا آغاز تھا - مدینہ میں پہلی مسلم کمیونٹی کا قیام۔\n\nیہ ہجرت، ابتدائی مسلمانوں کی جرات اور عقیدے کی ایک روشن مثال ہے، جس نے مستقبل میں اسلام کی ترقی اور پھلنے پھولنے کی بنیاد رکھی۔ حضور اکرم ﷺ کی قیادت اور ان کے پیروکاروں کے پختہ ایمان نے ایک مظلوم کمیونٹی کو ایک زندہ دل معاشرے میں بدل دیا، جس نے ہمیشہ کے لیے تاریخ کا رخ موڑ دیا۔\n',
    'حضرت محمد ﷺ اور مسلمانوں کا ہجرت کے ساتھ مدینہ منورہ آنا، اسلامی تاریخ کا ایک اہم ترین موڑ ہے۔ یہ صرف مقام کی تبدیلی نہیں تھی، بلکہ یہ اسلام کی بنیادوں پر تعمیر ہونے والے ایک نئے معاشرے کی پیدائش تھی۔\n\nانصار کا گرمجوشی سے استقبال:\u2000مکہ کے برعکس، مدینہ نے نبی اکرم ﷺ کا کھلے دل سے استقبال کیا۔ وہاں کے مسلمان، جو انصار (مددگار) کے نام سے جانے جاتے تھے، نے مہاجرین (مکہ سے ہجرت کرنے والے مسلمانوں) کا گرمجوشی اور سخاوت سے خیر مقدم کیا۔ مہاجرت کے بعد، مکہ میں اپنا سب کچھ چھوڑ کر آنے والے مسلمانوں کے لیے یہ مہمان نوازی اور اخوت کا جذبہ ایک محفوظ پناہ گاہ قائم کرنے میں بنیادی حیثیت رکھتا تھا۔ انصار نے مہاجرین کے ساتھ اپنے گھر، وسائل اور یہاں تک کہ اپنی بیویوں کا بھی اشتراک کیا۔ اس بے لوث تعاون نے اتحاد کا گہرا احساس پیدا کیا اور ایک مضبوط مسلم برادری کی بنیاد رکھی۔\n\nنبی اکرم ﷺ بطور سیاست دان: منشورِ مدینہ:\u2000حضرت محمد ﷺ صرف ایک دینی رہنما نہیں تھے، بلکہ مدینہ منورہ میں ایک دور اندیش سیاست دان کے طور پر بھی سامنے آئے۔ مدینہ کی متنوع آبادی کے لیے ایک سماجی اور سیاسی ڈھانچے کی ضرورت کا احساس کرتے ہوئے، آپ نے منشورِ مدینہ کا مسودہ تیار کیا۔ یہ قابلِ ذکر دستاویز، جو منشورِ مدینہ کے نام سے بھی جانی جاتی ہے، ایک انقلابی معاہدہ تھا جس نے ایک پُرامن اور منصفانہ معاشرے کی بنیاد رکھی۔\n\nمنشورِ مدینہ برداشت اور شمولیت کی ایک مثال تھا۔ اس نے تمام شہریوں کے حقوق کی ضمانت دی، چاہے ان کا مذہب کچھ بھی ہو - مسلمان، یہودی، اور مشرک۔ اس نے سماجی انصاف، باہمی احترام اور اجتماعی ذمہ داری کے اصولوں کو قانون میں شامل کیا۔ اس دستاویز نے ایک قانونی نظام اور پُرامن طریقے سے تنازعات کو حل کرنے کے لیے ایک ڈھانچہ بھی قائم کیا۔ اس جامع نقطہ نظر نے مدینہ کے تمام باشندوں کے لیے وابستگی اور تحفظ کا احساس پیدا کیا، اور اسے اس علاقے میں امید کی ایک کرن کے طور پر منوایا۔\n\nمہاجرین سے ایک ترقی پذیر کمیونٹی تک:\u2000رسول اکرم ﷺ کی قیادت اور مہاجرین اور انصار کے درمیان مضبوط رشتے نے ایک مظلوم مہاجر گروہ کو ایک پُرانے اور لچکدار کمیونٹی میں بدل دیا۔ مدینہ اسلامی تعلیم اور عمل کا مرکز بن گیا۔ قرآن کی وحی کا نزول جاری رہا، جو زندگی کے مختلف پہلوؤں پر رہنمائی فراہم کرتا ہے، عبادت سے لے کر سماجی تعامل تک۔ تعلیمی ادارے قائم کیے گئے اور اسلامی اصولوں کو روزمرہ کی زندگی میں شامل کیا گیا۔\n\nمدینہ منورہ میں اس دور نے اسلامی معاشرے کو پھلنے پھولنے کا مشاہدہ کیا۔ مکہ میں بونے گئے ایمان کے پودے آزادی اور قبولیت کے ماحول میں کھل اٹھے۔ مدینہ میں رکھی گئی بنیادوں نے مستقبل میں اسلام کی توسیع اور اسے دنیا بھر میں پھیلانے کی تحریک دی۔\n',
    'مدینہ میں مسلم کمیونٹی کے قیام کو عام لوگوں کی طرف سے مکمل طور پر قبولیت حاصل نہ ہو سکی۔ مکہ کے مشرک قریش، جو ابھی تک اپنے اسلامی ظہور سے پہلے کے رسوم و رواج سے وابستہ تھے اور اپنی طاقت کے ختم ہونے کے خوف سے پریشان تھے، اپنی دشمنی کو ترک کرنے پر راضی نہ ہوئے۔ منشورِ مدینہ میں شامل امن معاہدے کے باوجود، وہ اب بھی بڑھتی ہوئی مسلم کمیونٹی کے خلاف نفرت کا اظہار کرتے رہے۔\n\nبلااشتعال جارحیت: بدر اور احد کی جنگیں:\u2000سنہ 624 عیسوی میں، مکہ سے ایک قافلہ جو دولت سے لدا ہوا تھا، وہ مدینہ کے قریب سے گزرنے والا تھا۔ حالانکہ مسلمانوں کا جارحیت شروع کرنے کا کوئی ارادہ نہیں تھا، لیکن قریش نے مسلمانوں کی کسی بھی حرکت کو خطرہ سمجھا۔ ایک مکہی فوج، جو مسلمانوں سے تعداد میں بہت زیادہ تھی، نوخی مسلم کمیونٹی کو ختم کرنے کے ارادے سے مدینہ کی طرف روانہ ہوئی۔\n\nنبی اکرم ﷺ نے حکمتِ عملی اور پختہ ایمان کے ذریعے، مسلمانوں کو بدر کی جنگ میں ایک شاندار فتح سے ہمکنار کیا۔ اس غیر متوقع فتح نے نہ صرف مسلمانوں کے حوصلے بلند کیے بلکہ ایک طاقتور پیغام بھی دیا - ابھی ابھی بنی ہوئی مسلم کمیونٹی کو آسانی سے شکست نہیں دی جا سکتی۔\n\nتاہم، قریش نے شکست قبول کرنے سے انکار کر دیا۔ انتقام کی آگ میں جلتے ہوئے، انہوں نے ایک سال بعد ایک بڑی فوج جمع کی اور مدینہ کی طرف روانہ ہوئے۔ اس کے نتیجے میں سنہ 625 عیسوی میں ہونے والی احد کی جنگ، مسلمانوں کے لیے ایک زیادہ مشکل مقابلہ ثابت ہوئی۔ ابتدائی کامیابی کے باوجود، ایک حکمت عملی کی غلطی نے مسلم فوج کے ایک رخ کو بے نقاب کر دیا، جس کے نتیجے میں بھاری جانی نقصان ہوا۔ حالانکہ آخر کار پیچھے ہٹنے پر مجبور ہو گئے، لیکن مسلمانوں نے شاندار استقامت کا مظاہرہ کیا اور مکمل تباہی کو روک لیا۔ احد کی جنگ، اگرچہ ایک پسپائی تھی، لیکن جنگ کے زمانے میں نظم و ضبط اور اطاعت کی اہمیت کا ایک اہم سبق تھی۔\n',
    'احد میں اپنی کارکردگی سے حوصلہ بلند ہونے والے مکہی، ابھی تک مطمئن نہ ہوئے تھے۔ 627 عیسوی میں، انہوں نے مسلم کمیونٹی کو ہمیشہ کے لیے ختم کرنے کے عزم کے ساتھ ایک بڑی فوج جمع کی۔ اس محاصرے، جسے خندق کی لڑائی کے نام سے جانا جاتا ہے، نے دفاعی حکمت عملیوں میں ایک اہم موڑ کا نشان لگایا۔\n\nنبی اکرم ﷺ، جو ہمیشہ ایک ذہین رہنما تھے، نے ایک نئی دفاعی حکمت عملی وضع کی۔ انہوں نے مسلمانوں کو حکم دیا کہ وہ مدینہ کے ارد گرد ایک خندق کھودیں، جس سے مکہی گھڑسواروں کی حرکت میں رکاوٹ پیدا ہو اور ان کی عددی برتری ختم ہو جائے۔ اس جدت پسندانہ حکمت عملی کے ساتھ ساتھ، مسلم محافظوں کے پختہ عزم نے مکہی فوج کو ہفتوں کی بے بسی کے بعد محاصرہ چھوڑنے پر مجبور کر دیا۔\n\nخندق کی لڑائی نے نبی اکرم ﷺ کی حکمتِ عملی کی شان اور مسلم کمیونٹی کے بے مثال حوصلے کو دنیا کے سامنے پیش کیا۔ اس نے یہ واضح کر دیا کہ جب بھی مسلمانوں کو شدید مشکلات کا سامنا کرنا پڑا، تو ان کا ایمان، جدت پسندی اور اتحاد ان مشکلات پر قابو پا سکتے ہیں۔ یہ دفاعی جنگیں نہ صرف ابھی ابھی وجود میں آنے والی مسلم کمیونٹی کی بقا کو یقینی بنانے کا ذریعہ بنیں، بلکہ مدینہ میں ان کی پوزیشن کو بھی مضبوط کرتی ہیں، اور یہی وجہ ہے کہ آنے والی فتوحات اور آخر کار اسلام کے پھیلاؤ کی راہ ہموار ہوئی۔\n',
    'یہ سنہ 628 عیسوی تھا۔ ہجرت کے چھ سال بعد، مدینہ میں مسلم کمیونٹی کافی حد تک مضبوط ہو چکی تھی۔ نبی اکرم ﷺ، حج کے ارکان پورے کرنے اور مکہ میں عمرہ (چھوٹی حج) کرنے کی تمنا رکھتے ہوئے، مسلمانوں کے ایک بڑے گروہ کو لے کر مقدس شہر کی طرف روانہ ہوئے۔ تاہم، ان کے راستے میں ایک رکاوٹ پیدا ہو گئی - قریش نے ایک بار پھر ان کا راستہ روک لیا۔\n\nبند راستہ اور کشمکش:\u2000مسلم کمیونٹی کی بڑھتی ہوئی طاقت سے خوفزدہ اور انہیں مکہ کے مقدس مقامات میں عمرہ کی ادائیگی کی اجازت دے کر انہیں قانونی حیثیت دینے سے انکار کرتے ہوئے، قریش نے راستہ روک لیا۔ ایک کشیدہ صورتحال پیدا ہو گئی۔ جہاں کچھ صحابہ نے زبردستی کے جواب کی تلقین کی، وہیں نبی اکرم ﷺ نے قابلِ ذکر ضبط اور سیاسی بصیرت کا مظاہرہ کیا۔ آپ نے اس وقت اپنی افواج کی کمزوریوں کو تسلیم کیا اور سفارت کاری کا راستہ اختیار کیا۔\n\nمذاکرات اور ایک حکمت عملی پر مبنی معاہدہ:\u2000قریش کے نمائندوں کے ساتھ مذاکرات کے بعد، دس سالہ معاہدہ - حدیبیہ کا معاہدہ - طے پایا۔معاہدے کی شرائط ، پہلی نظر میں ، مراعات کی طرح لگ رہی تھیں۔ مسلمانوں کو اس سال مکہ میں داخل ہونے سے انکار کر دیا گیا اور وہ مدینہ واپس جانے پر راضی ہو گئے۔ تاہم، غور سے دیکھنے پر، نبی اکرم ﷺ کی حکمتِ عملی کی شاندار کارکردگی کا پتہ چلتا ہے۔\n\nپھل دینے والا معاہدہ:\u2000حدیبیہ کا معاہدہ، حالانکہ ابتدائی طور پر کچھ مسلمانوں نے اسے پسپائی سمجھا، لیکن یہ ایک سفارتی فتح ثابت ہوا۔ اس نے مسلمانوں کواہم پہچان دی ۔ قریش نے مسلم کمیونٹی کو ایک قانونی وجود کے طور پر تسلیم کیا اور دس سالہ امن معاہدے پر رضامندی ظاہر کی۔ امن کے اس دور نے مسلمانوں کو مدینہ میں اپنی طاقت کو مضبوط کرنے، اپنے اندرونی ڈھانچے کو مضبوط بنانے اور اسلام کو پھیلانے پر توجہ دینے کا موقع فراہم کیا۔ دوسری طرف، قریش اپنی نقل و حرکت میں محدود ہو گئے اور اپنی کچھ ساکھ کھو بیٹھے۔\n\nحدیبیہ کا معاہدہ، دراصل، مسلمانوں کے لیے قیمتی وقت خرید لایا۔ اس نے انہیں مضبوط ہونے اور آنے والے مستقبل کے تصادموں کے لیے تیار ہونے کا موقع دیا۔ نبی اکرم ﷺ کی اس حکمت عملی نے مستقبل کی فتوحات اور مکہ کی فتح کی راہ ہموار کی۔\n',
    'حدیبیہ کے معاہدے کے باوجود بھی، ابھی ابھی وجود میں آنے والی مسلم کمیونٹی کو خطرات لاحق تھے۔ ان میں سے ایک خطرہ شمال کے ایک واحے خیبر میں آباد یہودی قبیلے بنو نضیر سے تھا۔ اس قبیلے نے کھلم کھلا مسلمانوں کے خلاف سازشیں رچیں اور یہاں تک کہ منشورِ مدینہ کی خلاف ورزی بھی کی۔\n\nٹوٹا ہوا اعتماد اور کارروائی کی ضرورت:\u2000سنہ 627 عیسوی میں، مکہ والوں کے اکسانے پر، بنو نضیر نے نبی اکرم ﷺ کو قتل کرنے کا منصوبہ بنایا۔ معاہدے کی اس صریح خلاف ورزی کے بعد مسلمانوں کے پاس کارروائی کے علاوہ کوئی چارہ نہ تھا۔ نبی اکرم ﷺ نے مارچ 628 عیسوی میں خیبر کی طرف ایک مہم کی قیادت کی۔\n\nایک مضبوط گڑھ اور حکمت عملی پر مبنی جنگی چالیں:\u2000خیبر زرخی زمین سے گھرے ہوئے یہودی آبادیاں کا ایک مضبوط دفاعی نظام تھا۔ مسلمانوں کو ان مضبوط گڑھوں کو فتح کرنے میں ایک مشکل چیلنج کا سامنا تھا۔ اپنی حکمتِ عملی کے لیے مشہور نبی اکرم ﷺ نے یہودی دفاعی نظام کو الگ الگ کر کے تباہ کرنے کی حکمت عملی بنائی۔ آپ نے محاصرے کی حکمت عملی استعمال کی، رسد اور حوصلے کو کم کیا اور آخر کار اہم قلعوں پر نشانہ زد حملوں میں مصروف ہو گئے۔\n\nمستقبل کو محفوظ بنانا:\u2000فتح اور توحید: کئی لڑائیوں کے بعد، مسلمان فتح یاب ہوئے۔ بنو نضیر قبیلہ کو ہتھیار ڈالنے اور خیبر چھوڑنے پر مجبور کر دیا گیا۔ اس فتح نے نہ صرف مسلم کمیونٹی کے لیے ایک اہم خطرے کو ختم کر دیا بلکہ اہم وسائل اور زرعی زمین بھی حاصل کر لی۔ خیبر کی مہم نے مدینہ کو اسلامی طاقت کے مرکز کے طور پر مضبوط کیا اور مسلمانوں کی بڑھتی ہوئی فوجی قوت کا بھی اعلان کیا۔\n',
    'سنہ 628 عیسوی میں، مکہ کے قریش نے ایک سنگین غلطی کی۔ انہوں نے ایک حریف قبیلے کو مدینہ پر حملے کے لیے محفوظ راستہ دے کر حدیبیہ کے معاہدے کی خلاف ورزی کی۔ اعتماد کی اس خلاف ورزی نے نبی اکرم ﷺ کو ایک موقع فراہم کیا۔ آپ نے فائدہ اٹھاتے ہوئے 10,000 مسلمانوں کی فوج کو مکہ کی طرف روانہ کیا۔\n\nبےخبر قریش:\u2000مکہ والے، فوجی مقابلے کے لیے تیار نہ ہونے کی وجہ سے خوفزدہ ہو گئے۔ انہوں نے فتوحات کے بجائے حج کی توقع کی تھی۔ خونریزی کی کوئی خواہش نہ رکھتے ہوئے، نبی اکرم ﷺ نے یہ واضح کر دیا کہ ان کے ارادے پر امن ہیں۔ انہوں نے ہتھیار ڈالنے اور غیر جانبدار رہنے کا وعدہ کرنے والوں کو عام معافی کی پیشکش کی۔\n\nرحم اور معافی کی فتح:\u2000جب مسلمان فوج مکہ کے قریب پہنچی تو قریش قیادت کو احساس ہو گیا کہ مزاحمت بے سود ہے۔ انہوں نے بغیر لڑائی کے ہتھیار ڈال دیے۔ 17 رمضان 629 عیسوی کو، نبی اکرم ﷺ شاندار فتح کے ساتھ مکہ میں داخل ہوئے، لیکن قابلِ ذکر ضبط اور معافی کے ساتھ۔\n\nخانہ کعبہ کی صفائی اور اسلام کا قیام:\u2000نبی اکرم ﷺ (صلی اللہ علیہ وسلم) کے اولین اقدامات میں سے ایک، خانہ کعبہ، جو کہ مقدس مقام ہے، کو بتوں اور مشرک رسموں سے پاک کرنا تھا۔ انہوں نے صدیوں سے قائم بتوں کو توڑ دیا، خانہ کعبہ کو اس کے اصل مقصد، یعنی ایک خدا کی عبادت کے لیے بحال کر دیا۔ یہ عمل بت پرستی پر اسلام کی فتح کی علامت ہے اور عرب تاریخ کا ایک اہم موڑ ہے۔\n\nامن اور اتحاد کا پیغام:\u2000نبی اکرم ﷺ نے مکہ کے لوگوں سے خطاب کرتے ہوئے امن اور اتحاد کے پیغام پر زور دیا۔ انہوں نے عام معافی کا اعلان کیا، ان لوگوں کو بھی معاف کر دیا جنہوں نے ان اور مسلمانوں کو سالوں تک ستایا تھا۔ رحم اور سخاوت کے اس عمل نے بہت سے دلوں کو جیت لیا اور بڑھتی ہوئی مسلم کمیونٹی میں مکہ کے پر امن انضمام کی راہ ہموار کی۔\n\nفتح مکہ، جسے فتحِ بلڈلیس (خونریز فتح سے پاک فتح) کے نام سے بھی جانا جاتا ہے، نبی اکرم ﷺ کی جنگی حکمت عملی، پختہ ایمان اور قابلِ ذکر کردار کی گواہی ہے۔ یہ اسلام کی تاریخ میں ایک اہم سنگ میل ثابت ہوا، جس نے مکہ میں اس کی موجودگی کو مستحکم کیا اور اس کی مستقبل کی توسیع کی بنیاد رکھی۔\n',
    'سنہ 632 عیسوی تھا۔ ایک عظیم الشان موقع اس وقت رقم ختم ہوا جب نبی اکرم ﷺ نے اپنے آخری حج، حجۃ الوداع، پر مکہ کا رخ کیا۔ یہ حج مسلم کمیونٹی کے لیے بے پناہ اہمیت کا حامل تھا، کیونکہ یہ دنیا سے رخصت ہونے سے پہلے انہیں (نبی اکرم ﷺ کو) رہنمائی اور تعلیمات دینے کا آخری موقع تھا۔\n\nنبی اکرم ﷺ نے اس اہم سفر پر مسلمانوں کے ایک عظیم اجتماع کی قیادت کی۔ ماحول جذبات کے ایک جال میں گِھرا ہوا تھا - عقیدت، آس، اور شاید خاموشی کے ساتھ چھپا ہوا ایک خوف۔ یہ حج نبی اکرم ﷺ کی تعلیمات کی تکمیل اور مقدس شہر مکہ کو آخری الوداع کا کام دیتا تھا۔\n\nزمانوں کے لیے ایک خطاب:خطبہ حجۃ الوداع:\u2000حجۃ الوداع کے دوران، نبی اکرم ﷺ نے ایک زور دار اور فصیح خطبہ دیا جو زمانوں سے گونجتا رہا۔ یہ آخری خطبہ، جو خطبہ حجۃ الوداع کے نام سے جانا جاتا ہے، اسلامی اصولوں کی بنیاد اور آنے والی نسلوں کے لیے رہنما کے طور پر کام کرتا ہے۔\n\nنبی اکرم ﷺ نے بنیادی اسلامی اقدار کی اہمیت پر زور دیا جیسے کہ:\nتوحید:\u2000اللہ کی مطلق وحدانیت اور صرف اسی کی عبادت کرنے کی اہمیت۔\nمساوات:\u2000تمام مومنوں کی فطری مساوات، چاہے نسل، قومیت، یا سماجی حیثیت کچھ بھی ہو۔\nعدل:\u2000سب کے لیے عدل کا قیام، ہر کسی کے ساتھ انصاف اور رحم کے ساتھ سلوک۔\nرحم:\u2000دوسروں کے ساتھ، ضرورت مندوں اور یہاں تک کہ اپنے دشمنوں کے ساتھ بھی، رحم اور نرمی کا مظاہرہ کرنے کی اہمیت۔\nبرادری:\u2000مسلم کمیونٹی کی وحدت اور یکجہتی، ایک دوسرے کی مدد اور خیال رکھنے کی اہمیت پر زور دیتے ہوئے۔\n\nنبی اکرم ﷺ نے اسلامی زندگی کے دوسرے اہم پہلوؤں کو بھی مخاطب کیا جن میں شامل ہیں۔\nحج کے ارکان کی صحیح ادائیگی۔\nعورتوں اور بچوں کے ساتھ سلوک۔\nمالی ذمہ داریاں، جیسے زکوٰۃ (خیرات)۔\nتعلیم کی اہمیت اور علم کی تلاش۔\n\nخطبہ حجۃ الوداع صرف ہدایات کا ایک مجموعہ نہیں تھا؛ یہ ایک رہنما کا اپنے پیروکاروں کو دلی پیام تھا، ایک ایسا پیام جو زمان و مکان سے بلند تھا۔ یہ آج بھی مسلمانوں کی رہنمائی کرتا ہے، ایک نیک اور با معنی زندگی گزارنے کے لیے ایک خاکہ فراہم کرتا ہے۔\n',
    '\nحجۃ الوداع سے واپسی کے فوراً بعد، نبی اکرم ﷺ بیمار پڑ گئے۔ آپ 632 عیسوی میں انتقال فرما گئے، لیکن ایک ایسی میراث چھوڑ گئے جو دنیا بھر میں کروڑوں لوگوں کو متاثر کرتی رہے گی۔ مدنی دور، جو نبی اکرم ﷺ کی ہجرت اور پہلی مسلم کمیونٹی کے قیام سے نشان زد ہے، اسلام کو نیکی کی ایک عظیم طاقت کے طور پر جنم دیتا ہے۔\n\nپیغمبر اسلام صلی اللہ علیہ وسلم کی میراث مذہبی تعلیمات تک محدود نہیں ہے ۔ یہ سماجی انصاف ، اخلاقی طرز عمل اور ہمدردی کے اصولوں تک پھیلی ہوئی ہے ۔ انہوں نے منصفانہ اور مشاورت پر مبنی حکمرانی کا ایک نظام قائم کیا ، جو کمزور اور پسماندہ لوگوں کے حقوق کی وکالت کرتا تھا ۔ ان کی زندگی امید کی کرن کے طور پر کام کرتی ہے ، جو نہ صرف مسلمانوں بلکہ پوری انسانیت کے لیے رہنمائی فراہم کرتی ہے۔',
  ];
  final List<String> parentsUrduText = [
    'حضور نبی اکرم ﷺ کا سلسلہ نسب مکہ کی اس وقت کی غالب طاقت، قریش قبیلے سے جا ملتا ہے۔ ان کے والد، عبداللہ ابن عبد المطلب، نہ صرف ایک ممتاز قبیلے میں پیدا ہوئے تھے بلکہ تاریخی روایات انہیں اس قبیلے کے اندر ایک قابل احترام شخصیت کے طور پر پیش کرتی ہیں۔ یہ روایات ان کی حکمت اور مضبوط قیادت کی صلاحیتوں کو اجاگر کرتی ہیں، جو اس بات کا اشارہ ہیں کہ وہ ایک ایسے شخص تھے جنہیں عزت اور احترام حاصل تھا۔ ایسے خاندان میں پیدا ہونا بغیر کسی شک کے نبی اکرم ﷺ کی ابتدائی زندگی کو سنوارنے میں ایک اہم کردار ادا کرتا ہے۔ انہیں ذمہ داری کا احساس اور قیادت کی صلاحیتوں سے آگاہی ملی ہوگی جو بعد میں ان کے لیے مفید ثابت ہوئیں۔\n',
    'اپنی سماجی حیثیت سے بالاتر، عبداللہ اپنے ذاتی اوصاف کے لیے بھی لوگوں میں پسندیدہ تھے۔ انہیں ظاہری کشش اور باطنی خوبصورتی دونوں سے نوازا گیا تھا۔ وہ اپنی ذہانت کے لیے تو جانے جاتے ہی تھے، لیکن اس سے بھی زیادہ وہ اپنی مہربانی اور ہمدردی کے لیے مشہور تھے۔ دیانتداری، اچھا کردار اور سخاوت ان کی شخصیت کی امتیازی نشانیاں تھیں۔ یہ فضائل نبی اکرم ﷺ پر یقیناً ایک پائیدار اثر چھوڑ گئے ہوں گے۔ اپنے والد میں ان خوبیوں کو مجسم دیکھ کر وہ خود ایک ہمدرد اور نیک رہبر کے طور پر پروان چڑھے ہوں گے جنہوں نے انہی اقدار کو اپنایا۔\n',
    'تاریخی روایات سے پتہ چلتا ہے کہ عبداللہ اور پیغمبر اسلام (صلی اللہ علیہ وسلم) کی والدہ آمنہ بنت وہب کے درمیان شادی ایک خوشگوار موقع تھا ۔  ممتاز خاندانوں سے تعلق رکھنے والے دو افراد کے اس اتحاد کو گھیرے ہوئے جوش و خروش اور امید کا تصور کیا جا سکتا ہے ۔  تاہم ، افسوسناک طور پر ، یہ خوشی قلیل مدتی تھی ۔  عبداللہ نے اپنے بیٹے حضرت محمد صلی اللہ علیہ وسلم کی پیدائش سے پہلے ہی بچپن میں ہی وفات پا لیا۔اس ابتدائی انتقال نے نبی صلی اللہ علیہ وسلم کو بہت کم عمر میں یتیم کر دیا اور بلاشبہ ان کی پرورش پر اس کا نمایاں اثر پڑا ۔  ان کی نشوونما کے اس اہم مرحلے کے دوران والد کی غیر موجودگی نے ممکنہ طور پر پیغمبر (صلی اللہ علیہ وسلم) کے ابتدائی تجربات کو شکل دی اور اس نے ان کی ہمدرد نوعیت میں اہم کردار ادا کیا ۔  جسمانی موجودگی کی کمی کے باوجود ، عبداللہ کی میراث ان اقدار میں زندہ رہی جو انہوں نے مجسم کیں۔\n',
    'آمنہ بنت وہب (پیدائش: 549ء– وفات: 23 مئی 577ء) محمد صلی اللہ علیہ و آلہ وسلم کی والدہ محترمہ ہیں۔قبیلہ بنو زہرہ سے ہیں۔آپ کے والد کا نام وہب بن عبد مناف تھا۔ آپ کا تعلق قبیلہ بنو زہرہ سے تھا جو قریش ہی کا ایک ذیلی قبیلہ تھا۔ آپ کا سلسلہ نسب حضور صلی اللہ علیہ و آلہ وسلم کے جدِ امجد عبد مناف بن قصی سے ملتا ہے۔ محمد صلی اللہ علیہ و آلہ وسلم کے والد عبد اللہ بن عبد المطلب شادی کے کچھ عرصہ بعد حضور صلی اللہ علیہ و آلہ وسلم کی پیدائش سے تقریباً چھ ماہ پہلے وفات پا گئے۔ اس کے بعد آپ صلی اللہ علیہ و آلہ وسلم حضرت آمنہ (رضی اللہ عنہا) کے زیرِ پرورش رہے۔حضرت آمنہ (رضی اللہ تعالیٰ عنہا) مکہ اور یثرب (مدینہ) کے درمیان ایک سفر کے دوران ابواء کے مقام پر وفات پا گئیں۔ یہ 577ء تھا اور بی بی آمنہ (رضی اللہ تعالٰی عنہا) حضور صلی اللہ علیہ و آلہ وسلم کو یثرب (مدینہ) لے جا رہی تھیں تاکہ وہ اپنے ماموں سے ملیں اور اپنے والد عبد اللہ کی قبر کی زیارت بھی کریں۔\n\nآپ اپنے قبیلہ میں سیرت النساء کے نام سے مشہور تھیں۔ آخری حج کے دوران آنحضرت صلی اللہ علیہ و آلہ وسلم نے ان کی قبر مبارک کی زیارت کی اور ان کو یاد کر کے روئے۔ یہ جگہ ایک پتھریلا علاقہ ہے جو ایک پہاڑی کا ہموار حصہ ہے۔ ایسے خاندان میں پیدا ہونا اس بات کی نشان دہی کرتا ہے کہ فاطمہ ایک خاص سماجی حیثیت رکھتی تھیں اور ان کی پرورش عزت کے ساتھ ہوئی ہوگی۔\n',
    '\nاگرچہ تاریخی روایات آمنہ بنت وہب کی شخصیت کے بارے میں محدود تفصیلات پیش کرتی ہیں، لیکن بعض ذرائع انہیں قابل ذکر خوبیوں کی حامل خاتون کے طور پر بیان کرتے ہیں۔ یہ ذرائع بتاتے ہیں کہ وہ خوبصورتی، ذہانت اور گہری ایمان (پرہیزگاری) سے مزین تھیں۔ ان کی شخصیت کی یہ جھلکیاں ایک ایسی خاتون کی تصویر پیش کرتی ہیں جو فضل و کمال، حکمت اور اپنے ایمان کے ساتھ مضبوط تعلق رکھتی تھیں۔ یہ ممکن ہے کہ ان صفات نے ابتدائی نازک عمر میں نبی اکرم ﷺ کو بہت زیادہ متاثر کیا ہو۔',
    '\nعبداللہ کے المناک انتقال کے بعد نوجوان پیغمبر (صلی اللہ علیہ وسلم) کی پرورش کی ذمہ داری آمنہ بنت وہب پر آ گئی ۔  اس نے اس بے پناہ کام کو لگن کے ساتھ اپنے کندھوں پر اٹھایا ، اس کی ضروریات کو پورا کیا اور اپنی وفات تک اس کی پرورش کی جب وہ تقریبا چھ سال کا تھا ۔  اگرچہ ان کے بندھن کے بارے میں تفصیلات نامعلوم ہیں ، لیکن یہ فرض کرنا محفوظ ہے کہ ان اہم ابتدائی سالوں کے دوران اس نے جو محبت اور رہنمائی پیش کی اس نے نبی صلی اللہ علیہ وسلم پر دیرپا اثر ڈالا۔',
    'اتنی کم عمر میں والدین دونوں کو کھونا بلاشبہ نوجوان نبی صلی اللہ علیہ وسلم کے لیے بے پناہ چیلنجز کا باعث بنا۔ تاہم ، ان کے ابتدائی سالوں کے دوران آمنہ بنت وہب نے ممکنہ طور پر ان میں جو طاقت اور غیر متزلزل ایمان (تقوی) پیدا کیا اس نے ان کے کردار کی تشکیل میں اہم کردار ادا کیا ۔ آمنہ بنت وہب کی میراث صرف نبی صلی اللہ علیہ وسلم کی ماں ہونے سے آگے بڑھ گئی ہے۔ وہ مشکلات کا سامنا کرتے ہوئے غیر متزلزل محبت ، غیر متزلزل عقیدے اور لچک کی علامت کے طور پر کھڑی ہے۔\n',
  ];
  final List<String> wivesUrduText = [
    'اسلامی تاریخ میں حضرت خدیجہ بنت خویلد (رضی اللہ تعالیٰ عنها) ایک قابل ذکر شخصیت ہیں، نہ صرف یہ کہ وہ نبی اکرم حضرت محمد صلی اللہ علیہ وسلم کی پہلی زوجہ تھیں بلکہ ان کی زندگی میں ان کے کردار کے لحاظ سے بھی ان کا مقام کلیدی ہے۔ آئیے ان کی زندگی اور ان کے دور رس اثر پر ایک نظر ڈالتے ہیں۔\n\nامتیازی خاتون:\u2000 حضرت خدیجہ (رضی اللہ تعالیٰ عنها) ایک کامیاب تاجر خاتون تھیں جو اپنی ذہانت اور فطرتِ سلیم کے لیے جاتی تھیں۔ وہ مکہ کے ایک ممتاز تاجر خاندان سے تعلق رکھتی تھیں اور آزادانہ طور پر اپنی منافع بخش تجارتی منڈیوں کا انتظام چلاتی تھیں۔ اس سے نہ صرف انہیں مالی آزادی حاصل ہوئی بلکہ ان کی ساکھ اعتماد اور منصفانہ معاملات کے لیے بھی قائم ہوئی۔\n\nنبی اکرم صلی اللہ علیہ وسلم کے لیے سہارے کا چراغ:\u2000 جب حضرت خدیجہ (رضی اللہ تعالیٰ عنها) نے پہلی بار نبی اکرم صلی اللہ علیہ وسلم کو نکاح کا پیغام دیا تو آپ ان کی خوبیوں سے بہت متاثر ہوئے۔ ان کی شادی نبی اکرم صلی اللہ علیہ وسلم کے لیے 25 سالہ دورِ زوجیت میں بے پنا سہارا اور راحت کا باعث بنی۔ حضرت خدیجہ (رضی اللہ تعالیٰ عنها) نے انہیں جذباتی اور مالیاتی مدد فراہم کی، خاص طور پر ان ابتدائی اور نازک سالوں میں جب ان پر قرآن کی پہلی آیات نازل ہوئیں۔ ان میں نبی اکرم صلی اللہ علیہ وسلم اور ان کے پیغام پر کامل یقین اس مشکل دور میں تسلی اور حوصلہ افزائی کا ایک مستقل ذریعہ تھا۔\n\nایک مضبوط اور خیال رکھنے والی بیوی:\u2000 تاریخی روایات حضرت خدیجہ (رضی اللہ تعالیٰ عنها) کو نبی اکرم صلی اللہ علیہ وسلم کے لیے طاقت کے ستون کے طور پر پیش کرتی ہیں۔ انہوں نے نہ صرف انہیں مالی تحفظ فراہم کیا بلکہ ان کو نبوت کے مشن کی مشکلات سے نمٹنے کے لیے ایک محفوظ اور پیار بھرا ماحول بھی دیا۔ ان کا رشتہ باہمی احترام، اعتماد اور محبت پر قائم تھا۔ حضرت خدیجہ نے ان کے چھ بچوں کو جنم دیا - دو بیٹے (قاسم اور عبداللہ) اور چار بیٹیاں (زینب، رقیہ، ام کلثوم اور فاطمہ)۔\n\nایمان اور استقامت کا ورثہ: \u2000 اسلام پر حضرت خدیجہ (رضی اللہ تعالیٰ عنها) کا ایمان پختہ تھا۔ وہ نبی اکرم صلی اللہ علیہ وسلم پر نازل ہونے والے پیغام کو قبول کرنے والے پہلے لوگوں میں سے ایک تھیں۔ اسلام کے ابتدائی سالوں میں ان کا یقین اور بے لوث حمایت اس مذہب کی بنیاد رکھنے میں کلیدی حیثیت رکھتی تھی۔  حضرت خدیجہ (رضی اللہ تعالیٰ عنها) کی میراث ان کی شادی سے کہیں آگے تک پھیلی ہوئی ہے۔ انہیں ایک غیر معمولی ذہین، با ایمان اور مضبوط خاتون کے طور پر یاد کیا جاتا ہے جنہوں نے نبی اکرم صلی اللہ علیہ وسلم اور ابتدائی مسلم کمیونٹی کی زندگی میں اہم کردار ادا کیا۔\n',
    'حضرت خدیجہ بنت خویلد (رضی اللہ تعالیٰ عنها) کے انتقال کےبعد، نبی اکرم صلی اللہ علیہ وسلم نے حضرت سودہ بنت زمعہ (رضی اللہ تعالیٰ عنها) سے نکاح کیا۔  اگرچہ ان کی زندگی کے بارے میں تفصیلات کم ہیں، لیکن تاریخی روایات انہیں ایک قابل ذکر شخصیت کے طور پر پیش کرتی ہیں جنہوں نے نبی اکرم صلی اللہ علیہ وسلم کے گھر میں ایک اہم کردار ادا کیا۔\n\nمہربانی پر مبنی ایک رشتہ:\u2000 نبی اکرم صلی اللہ علیہ وسلم اور حضرت سودہ بنت زمعہ (رضی اللہ تعالیٰ عنها) کے نکاح کے پیچھے کی وجوہات واضح طور پر دستاویزات میں موجود نہیں ہیں۔ تاہم، بعض علماء اس بات کا مشورہ دیتے ہیں کہ یہ حضرت خدیجہ (رضی اللہ تعالیٰ عنها) کے انتقال کے بعد غم کے اس دور میں انہیں ساتھ اور مدد فراہم کرنے کی خواہش سے پیدا ہوا ہوگا۔ خود حضرت سودہ بنت زمعہ (رضی اللہ تعالیٰ عنها) بھی شاید اس نکاح میں سہارا اور تحفظ پاتی ہوں گی۔\n\nگھر میں طاقت کا ایک ستون:\u2000 تاریخی واقعات انہیں ایک مہربان اور صبر کرنے والی خاتون کے طور پر بیان کرتے ہیں۔ یہ خصوصیات ممکنہ طور پر پیغمبر اسلام صلی اللہ علیہ وسلم کے بڑھتے ہوئے گھر کو سنبھالنے میں انمول ثابت ہوئیں، خاص طور پر اضافی بیویوں کی آمد کے بعد۔ کہا جاتا ہے کہ اس نے پیغمبر اکرم صلی اللہ علیہ وسلم کے بچوں کی دیکھ بھال میں معاون کردار ادا کیا اور گھریلو ماحول کی مجموعی ہم آہنگی میں اپنا کردار ادا کیا۔وہ خاموش طاقت، ہمدردی اور مسلم برادری کی نمایاں ترقی کے اس دور میں ایک ہم آہنگ گھرانہ قائم رکھنے کی اہمیت کی علامت کے طور پر کھڑی ہیں۔\n',
    'حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها) اسلامی تاریخ میں ایک بلند پایہ مقام رکھتی ہیں، نہ صرف یہ کہ وہ نبی اکرم صلی اللہ علیہ وسلم کی تیسری بیوی تھیں بلکہ اسلامی علم میں ان کی بے پنا خدمات کے لیے بھی جانی جاتی ہیں۔ آئیے ان کی قابل ذکر زندگی اور علمی ورثے پر ایک نظر ڈالتے ہیں۔\n\nکم عمر دلہن: \u2000حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها) کم عمر تھیں جب ان کا نکاح نبی اکرم صلی اللہ علیہ وسلم سے ہوا۔ اس رشتے نے نبی اکرم صلی اللہ علیہ وسلم اور ان کے قریبی ساتھی حضرت ابو بکر صدیق (رضی اللہ تعالیٰ عنہ) کے درمیان تعلق کو مضبوط بنایا۔\n\nذوق شوق رکھنے والی سیکھنے والی:\u2000 حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها) تیز ذہن اور قابل ذکر یادداشت رکھتی تھیں۔ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ رہتے ہوئے کئی سال اسلام کے بارے میں سیکھنے، ان کی عادات و اطوار کو مشاہدہ کرنے اور ان کی تعلیمات کو یاد کرنے میں گزارے۔ ان کی جستجو کرنے والی فطرت اور تیز ذہن نے انہیں علم حاصل کرنے کے لیے مثالي بنا دیا۔\n\nحدیث کی ایک  بارعب راویہ:\u2000 نبی اکرم صلی اللہ علیہ وسلم کی وفات کے بعد، حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها) اسلامی علم کا ایک اہم ذریعہ بن کر ابھریں۔ انہوں نے اپنی زندگی بھر 2,000 سے زائد احادیث (نبی کی  اقوال اور روایات)  روایت کیں۔ ان کا وسیع علم،  شاندار یادداشت اور عمیق مشاہدے کی صلاحیتوں نے ان کی روایات کو انتہائی قابل احترام اور معتبر بنا دیا۔ ان روایتوں نے اسلامی فقہ اور مسلم کمیونٹی کے اندر روزمرہ کی پریکٹس کو سنوارنے میں اہم کردار ادا کیا۔\n\nایمان کی محافظ:\u2000 حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها)  صرف علم کی منتقل کرنے والی ہی نہیں تھیں بلکہ وہ اسلام کی ایک مضبوط محافظ بھی تھیں۔ انہوں نے  علمی مناظروں اور مباحثوں میں  فعال  طور پر حصہ لیا، اپنے علم اور  فراست کا استعمال کرتے ہوئے اسلامی  اصولوں کا دفاع کیا۔ ان کی  خدمات نے اسلامی اسکالرشپ کی ترقی کو  بہت متاثر کیا۔\n\nعلم اور حکمت کا ورثہ:\u2000  اسلام پر حضرت عائشہ بنت ابی بکر (رضی اللہ تعالیٰ عنها)  کا اثر انکار نہیں کیا جا سکتا۔ ان کے وسیع علم، مضبوط یادداشت اور نبی اکرم صلی اللہ علیہ وسلم کی تعلیمات کو آگے بڑھانے کے لیے وقف کردہ زندگی نے آنے والی نسلوں کے لیے اسلامی علم کو محفوظ رکھنے اور اسے عام کرنے میں کلیدی کردار ادا کیا۔ انہیں ایک اسکالر، ایک استاد اور علم حاصل کرنے اور اسلامی  مباحثوں میں  سرگرم  طور پر حصہ لینے والی مسلمان عورتوں کے لیے ایک رول ماڈل کے طور پر  جانا جاتا ہے۔\n',
    'حضرت حفصہ بنت عمر (رضی اللہ تعالیٰ عنها) اسلامی تاریخ میں ایک اہم شخصیت ہیں، نہ صرف یہ کہ وہ نبی اکرم صلی اللہ علیہ وسلم کی بیویوں میں سے ایک تھیں بلکہ ان کی شادی نے مسلم کمیونٹی کے اندر روابط کو مضبوط بنانے میں بھی کردار ادا کیا۔\n\nممتاز صحابی کی بیٹی:\u2000 حضرت حفصہ بنت عمر (رضی اللہ تعالیٰ عنها) حضرت عمر ابن الخطاب (رضی اللہ تعالیٰ عنہ)  کی صاحبزادی تھیں، جو نبی اکرم صلی اللہ علیہ وسلم کے ایک بااثر اور طاقتور صحابی تھے۔ حضرت عمر (رضی اللہ تعالیٰ عنہ) بعد میں اسلام کے دوسرے خلیفہ بھی بنے، جس سے یہ بات واضح ہوتی ہے کہ حضرت حفصہ ایک ممتاز خاندان سے تعلق رکھتی تھیں۔\n\nگہری معنیٰ والی ایک  رشتہ:\u2000 حضرت حفصہ بنت عمر (رضی اللہ تعالیٰ عنها)  کی پہلی شادی ایک مسلمان  قبول  کنندگان، خزائہ بن حذافہ سے ہوئی تھی۔  افسوس کی بات ہے کہ وہ جنگ احد میں شہید ہو گئے۔ ان کی شہادت کے بعد، حضرت حفصہ بیوہ رہ گئیں۔  نبی اکرم صلی اللہ علیہ وسلم کا حضرت حفصہ (رضی اللہ تعالیٰ عنها) سے نکاح اس مشکل وقت میں ان کے لیے ہمدردی اور  معاونت کے اظہار کے طور پر دیکھا جا سکتا ہے۔  اس رشتے نے ایک حکمت عملی پر مبنی مقصد بھی پورا کیا، اس نے نبی اکرم صلی اللہ علیہ وسلم اور بااثر حضرت عمر ابن الخطاب (رضی اللہ تعالیٰ عنہ) کے درمیان تعلق کو مزید مستحکم کیا، جو ابتدائی مسلم کمیونٹی کے اندر اتحاد اور استحکام کو فروغ دیتا تھا۔\n\nعقیدت سے بھرپور زندگی:\u2000  حضرت حفصہ (رضی اللہ تعالیٰ عنها) ایک پرہیزگار اور  عقیدت مند خاتون تھیں۔ انہیں نبی اکرم صلی اللہ علیہ وسلم سے نکاح میں یقیناً سہارا اور آسودگی ملی ہوگی۔ انہیں قرآن کے ایک حصے کی حفاظت میں کردار ادا کرنے کا بھی سہرا دیا جاتا ہے جو نبی اکرم صلی اللہ علیہ وسلم پر نازل ہوا تھا۔\n\nاتحاد کی میراث:\u2000 حضرت حفصہ بنت عمر (رضی اللہ تعالیٰ عنها) کا نبی اکرم صلی اللہ علیہ وسلم سے نکاح صرف ذاتی تعلق سے بالاتر ہے۔ یہ مسلم کمیونٹی کے اندر مضبوط رشتے قائم کرنے کی اہمیت کی ایک تاریخی یاد دہانی کے طور پر کام کرتا ہے۔ ان کی کہانی  نبی اکرم صلی اللہ علیہ وسلم کی  مہربانی اور  ابتدائی مسلمانوں کو جوڑنے والے  رشتوں کو مضبوط بنانے کے لیے ان کے حکمت عملی پر مبنی  نقطہ نظر کو اجاگر کرتی ہے۔\n',
    'حضرت زینب بنت خزیمہ رضی اللہ تعالیٰ عنہا (26ق.ھ / 4ھ) (عربی: زينب بنت خزيمة، ام المساکین، مساکین کی ماں) آنحضرت صلی اللہ علیہ و آلہ وسلم کی ازواج میں سے پانچویں زوجہ تھیں۔آپ رضی اللہ عنہا بچپن ہی سے بہت سخی تھیں غریبوں اور مسکینوں کو ڈھونڈ ڈھونڈکر کھانا کھلایا کرتی تھیں اس لیے لوگ ان کو ،،ام المساکین،، (مسکینوں کی ماں) کہا کرتے تھے پہلے مشہور صحابی حضرت عبداللہ بن جحش رضی اللہ تعالیٰ عنہ سے ان کا نکاح ہوا تھا لیکن جب وہ جنگ احد میں شہید ہو گئے تو حضور صلی اللہ تعالیٰ علیہ واٰلہٖ وسلّم نے 3ھ میں ان سے نکاح کر لیا اور یہ ،،ام المساکین،، کی جگہ ،،ام المومنین،، کہلانے لگیں مگر یہ حضور صلی اللہ تعالیٰ علیہ واٰلہٖ وسلّم سے نکاح کے بعد صرف دو یا تین مہینے زندہ رہیں اور ربیع الاول 4ھ میں بمقام مدینہ منورہ وفات پاگئیں اور جنت البقیع میں ازواج مطہرات کے پہلو میں مدفون ہوئیں حضور اکرم صلی اللہ تعالیٰ علیہ واٰلہٖ وسلّمان کی وفات تک ان سے بے حد خوش رہے اور ان کی وفات کا قلب نازک پر بڑا صدمہ گذرا یہ ماں کی جانب سے حضرت ام المومنین بی بی میمونہ رضی اللہ تعالیٰ عنہا کی بہن ہیں ان کی وفات کے بعد حضور صلی اللہ تعالیٰ علیہ واٰلہٖ وسلّم نے ان کی بہن میمونہ رضی اﷲ تعالیٰ عنہا سے نکاح فرمایا۔\n\nنام و نسب: \u2000آپ کا نام زینب ہے، سلسلہ نسب اس طرح ہے زینب بنت خزیمہ بن حارث بن عبد اللہ بن عمرو بن عبدمناف بن ہلال بن عامر بن صعصعہ بن معاویہ بن بکر بن ہوازن منصور بن عکرمہ بن خصفہ بن خنیس بن عیلاں الہلالیہ۔ سیدہ زینب بنت خزیمہ رضی اللہ تعالیٰ عنہا کا سلسلہ نسب نبی کریم صلی اللہ علیہ وسلم کے نسب میں اکیسویں پشت میں جا کر معد بن عدنان سے مل جاتا ہے۔ آپ کی وفات کے بعد نبی اکرم نے آپ کی بہن میمونہ بنت حارث سے شادی فرمائی۔ ان دونوں کی والدہ ہند بنت عوف تھیں۔\n\nام المساکین کا لقب:\u2000 آپ رضی اللہ عنہا میں غریب پروری کوٹ کوٹ کر بھری ہوئی تھی، مساکین کو کھانا کھلانا اور ان کی دیگرمعاشی ضروریات کو پورا کرنا آپ کے اخلاق عالیہ کا عکاس تھا اسی وجہ سے زمانہ جاہلیت سے ہی لوگ آپ کو’’اُم المساکین‘‘کہا کرتے تھے۔غریب پروری او رمساکین کی دیکھ بھال کرنا ایسے عمدہ اوصاف ہیں کہ قرآن کریم نے بطور خاص ان کی تعریف کی ہے۔ چنانچہ ایسے ہی لوگوں کے بارے میں قرآن کریم کی سورۃ الدھر آیت 8 تا 10میں ہے:  وَ یُطعِمُوْنَ الطَّعَامَ عَلٰی حُبِّہٖ مِسْکِیْنًا وَّ یَتِیمًا وَّ اَسِیْرًا۔اِنَّمَا نُطعِمُکُمْ لِوَجْہِ اللٰہِ لَا نُرِیْدُ مِنْکُمْ جَزَآءً وَّ لَا شُکُوْرًا۔ اِنَّا نَخَافُ مِنْ رَّبِّنَا یَوْمًا عَبُوْسًا قَمْطَرِیْرًا۔\n\nترجمہ: \u2000اور اللہ کی محبت میں مسکین، یتیم اور قیدی کو کھانا کھلاتے ہیں (اور ان سے کہتے ہیں کہ) ہم تمھیں صرف اللہ کی خاطر کھلا رہے ہیں۔ ہم تم سے نہ کوئی بدلہ چاہتے ہیں نہ شکریہ۔ ہمیں تو اپنے رب سے اس دن کے عذاب کا خوف لاحق ہے جو سخت مصیبت کاطویل ترین دن ہو گا۔\n\nوفات:\u2000 آنحضرت صلی اللہ علیہ وآلہ وسلم سے نکاح کے صرف دو تین ماہ کے بعد ہی ان کا انتقال ہو گیا۔ وفات کے وقت عمر 30 سال تھی رسول اللہ صلی اللہ تعالیٰ علیہ وآلہ وسلم نے نماز جنازہ پڑھائی اور جنت البقیع میں دفن ہوئیں۔ بعض کے نزدیک ان کا انتقال نکاح کے بعد تقریبا دو برس کے عرصہ میں ہوا۔شیخ عبدالحق محدث دہلوی رحمہ اللہ نے لکھا ہے کہ سیدہ زینب رضی اللہ تعالیٰ عنہا نے 4ھ ماہ ربیع الثانی میں وفات پائی۔ آپ رضی اللہ عنہا کا جنازہ خود نبی کریم صلی اللہ علیہ وآلہ وسلم نے پڑھایا اور آپ کو مدینہ منورہ جنت البقیع نامی قبرستان میں دفن کر دیا گیا۔ امہات المومنین میں سے صرف سیدہ زینب بنت خزیمہ رضی اللہ تعالیٰ عنہا کا یہ اعزاز ہے کہ آپ رضی اللہ عنہا کا جنازہ خود نبی کریم صلی اللہ علیہ وسلم نے پڑھایا۔\n',
    'ہند بنت ابی امیہ (رضی اللہ عنہا)، جو ام سلمہ کے نام سے مشہور ہیں (جس کا مطلب ہے "سلمہ کی ماں")، اسلامی تاریخ میں ایک قابل ذکر شخصیت کے طور پر کھڑی ہے۔ اس کی زندگی کا سفر ابتدائی مسلمانوں کو درپیش چیلنجوں اور کامیابیوں دونوں کی عکاسی کرتا ہے، جو اس کے اٹل ایمان اور طاقت کو ظاہر کرتا ہے۔\n\nمشرکیت سے اسلام کی طرف: \u2000 ہند قریش کے ایک ممتاز قبیلے مخزومی میں پیدا ہوئیں، جو مکہ کا ایک طاقتور خاندان تھا۔ ان کے پہلے شوہر، ابو سلمہ بن عبدالاسد، بھی اسلام قبول کرنے والے ابتدائی لوگوں میں سے تھے۔ تاہم، اسلام کے ابتدائی سالوں کے دوران، قریش نے نبی اکرم محمد ﷺ کی تعلیمات کی شدید مخالفت کی۔ اس مخالفت کے باوجود، ہند اور ان کے شوہر نے پورے دل سے اسلام قبول کر لیا۔\n\nپناہ کی تلاش اور زندگی کی تعمیر: \u2000 قریش کے ظلم و ستم کا سامنا کرتے ہوئے، ہند اور ابو سلمہ، دیگر مسلمانوں کے ساتھ حبشہ میں پناہ لینے چلے گئے۔ یہ ہجرت، جسے پہلی ہجرت کے نام سے جانا جاتا ہے، مسلمان کمیونٹی کے قیام میں ایک مشکل لیکن انتہائی ضروری قدم تھا۔ مکہ واپسی کے بعد، ہند اور ابو سلمہ کو مشکلات کا سامنا کرنا پڑا لیکن وہ اپنے ایمان پر قائم رہے۔\n\nیک نقصان اور ایک نئی ابتداء: \u2000 افسوس کی بات ہے کہ، ہند کے شوہر، ابو سلمہ، نبی اکرم صلی اللہ علیہ وسلم کی حیات میں ہی فوت ہو گئے۔ چھوٹے بچوں کے ساتھ بیوہ ہونے کے بعد، ہند کو اپنے ایمان اور مسلمان کمیونٹی کی حمایت میں تسلی ملی۔ ان کی حکمت اور پرہیزگاری کو تسلیم کرتے ہوئے، نبی اکرم صلی اللہ علیہ وسلم نے ان سے نکاح کا پیغام بھیجا۔ اس رشتے نے نہ صرف ہند کے لیے جذباتی سہارا فراہم کیا بلکہ نبی اکرم صلی اللہ علیہ وسلم اور ان صحابہ کے درمیان تعلقات کو بھی مضبوط کیا جو اپنے ایمان کی خاطر بہت زیادہ تکالیف برداشت کر چکے تھے۔\n\nعلم اور ایمان کی میراث: \u2000 ام سلمہ (رضي الله عنها) کو ان کی ذہانت، حکمت اور اسلام کی گہری سمجھ کے لیے احترام دیا جاتا ہے۔ وہ مذہبی مباحثوں میں سرگرم عمل تھیں اور انہوں نے احادیث (نبی ﷺ کی  اقوال اور روایات) کی بہت زیادہ روایت کی۔ ان کی روایات کو انتہائی قابل اعتماد سمجھا جاتا ہے اور انہوں نے اسلامی علم کو آنے والی نسلوں تک پہنچانے میں اہم کردار ادا کیا۔\n\nمسلمان خواتین کے لیے ایک رول ماڈل: \u2000 ام سلمہ (رضي الله عنها) کی زندگی کی کہانی مسلمان خواتین کے لیے ایک تحریک کا کام کرتی ہے۔ وہ استقامت، پختہ ایمان اور سیکھنے اور اسلام کی نشو و نما میں اپنا حصہ ڈالنے کے عزم کا مظاہرہ کرتی ہیں۔ ان کی حکمت اور پرہیزگاری کی صدیوں بعد بھی تعریف کی جاتی ہے۔\n',
    'زینب بنت جحش (رضي الله عنها) اسلامی تاریخ میں ایک منفرد مقام رکھتی ہیں۔ نبی اکرم صلی اللہ علیہ وسلم کے گود لیے بیٹے، زید بن حارثہ سے ان کا نکاح اور اس کے بعد ان کی زوجیت سے وابستہ واقعات، اسلامی تعلیمات میں رکھنے کے تصور اور سماجی تعلقات کو سمجھنے کے لیے ایک خاص اہمیت کے حامل ہیں۔\n\nپیچیدگیوں والا ایک رشتہ: \u2000 زینب بنت جحش (رضي الله عنها) کا نکاح سب سے پہلے زید بن حارثہ سے ہوا تھا، جو ایک آزاد کردہ غلام تھے جنہیں نبی اکرم صلی اللہ علیہ وسلم نے اپنے بیٹے کے طور پر پالا تھا۔ نبی اکرم صلی اللہ علیہ وسلم سماجی مساوات کو فروغ دینا اور اس وقت کے موجودہ طبقاتی نظام کو چیلنج کرنا چاہتے تھے۔ تاہم، اس نکاح کو مشکلات کا سامنا کرنا پڑا۔\n\nایک الہیٰ وحی اور سماجی اصلاح: \u2000 زینب بنت جحش (رضي الله عنها) سے نبی اکرم صلی اللہ علیہ وسلم کے نکاح کے بارے میں قرآن مجید کی سورة الاحزاب، آیت 33:37 اسلامی تاریخ کا ایک اہم موڑ ہے۔ یہ آیت نکاح کی پابندیوں کے حوالے سے، اپنائے ہوئے بچوں کو حقیقی بچوں کے برابر سمجھنے کے تصور کو ختم کرتی ہے۔ اس وحی نے زینب بنت جحش (رضي الله عنها) کے لیے نبی اکرم صلی اللہ علیہ وسلم سے نکاح کا راستہ ہموار کیا اور ان کا پہلا نکاح ختم کر دیا۔ اس واقعے نے موجودہ سماجی روایات کو چیلنج کیا اور مسلمان کمیونٹی کے اندر مساوات کو فروغ دیا۔\n\nتاویلات اور اہمیت: \u2000 زینب بنت جحش (رضي الله عنها) کے نکاح اور اس کے بعد آنے والی وحی کی کہانی کی مختلف طریقے سے تشریح کی گئی ہے۔ بعض علماء سماجی اصلاح کے پیغام پر زور دیتے ہیں، جس میں رکھنے کے حوالے سے امتیازی سلوک کی ختمیت کو اجاگر کرتے ہیں۔ دوسرے نکاح میں جوڑے کی رضامندی اور جذباتی آسودگی کی اہمیت پر زور دیتے ہیں۔\n\nنکاح سے آگے ایک ورثہ: \u2000 زینب بنت جحش (رضي الله عنها) کی زندگی نبی اکرم صلی اللہ علیہ وسلم سے نکاح سے کہیں آگے ہے۔ وہ اپنی پرہیزگاری، سخاوت اور ابتدائی مسلم کمیونٹی میں سرگرم شرکت کے لیے جانی جاتی ہیں۔ اس کی کہانی اسلامی سماجی طریقوں کی ارتقائی نوعیت اور الہی رہنمائی کے ذریعے معاشرتی حقائق کے جواب کی اہمیت کی یاد دہانی کے طور پر کام کرتی ہے۔\n',
    'جويرية بنت الحارث (رضي الله عنها) اسلامی تاریخ میں رحم دلی اور تبدیلی کی ایک قابل ذکر مثال ہیں۔ ان کا سفر، ایک جنگی قیدی ہونے سے نبی اکرم صلی اللہ علیہ وسلم کی بیوی بننے تک، نبی اکرم ﷺ کے رحم کے اصولوں اور ابتدائی اسلامی معاشرے کے سیاق و سباق میں مثبت تبدیلی کے امکان کو اجاگر کرتا ہے۔\n\nقبضہ اور اس کے بعد کے واقعات:\u2000 جویریہ بنت الحارث (رضي الله عنها) بنو مصطلق قبیلے سے تعلق رکھتی تھیں۔ ہجرت کے چھٹے سال کے آس پاس، اس قبیلے اور ابتدائی مسلم کمیونٹی کے درمیان ایک فوجی مقابلے کے دوران، جویریہ کو دیگر افراد کے ساتھ قیدی بنا لیا گیا۔ قیدی بننے کے بعد، جویریہ (رضي الله عنها) نے فدیہ کے ذریعے اپنی آزادی کی تلاش کی۔ وہ ایک شریف النسل خاندان سے تعلق رکھتی تھیں اور ان کا خاندان ان کی رہائی کے لیے بات چیت کرنے کے لیے تیار تھا۔\n\nایک غیر متوقع موڑ:\u2000 روایات کے مطابق، نبی اکرم صلی اللہ علیہ وسلم نے جویریہ (رضي الله عنها) کے معاملے میں مداخلت کی۔ انہوں نے خود ان کی فدیہ میں حصہ دینے کی پیشکش کی، اور رہائی کے بعد، انہوں نے ان سے نکاح کا پیغام بھیجا۔ یہ تجویز بہت سے لوگوں کے لیے حیران کن تھی، لیکن جویریہ (رضي الله عنها) نے اسے بخوشی قبول کر لیا۔ پیغمبر اکرم صلی اللہ علیہ وسلم کا جویریہ (رضي الله عنها) سے نکاح صرف ذاتی معاملے سے کہیں زیادہ اہمیت کا حامل تھا۔ اس رشتے نے کئی مقاصد پورے کیے۔\n\nرحم کی ترویج:\u2000 جویریہ (رضي الله عنها) سے نکاح کرکے، نبی اکرم صلی اللہ علیہ وسلم نے قابل ذکر رحم دلی کا مظاہرہ کیا اور اس وقت لڑی جانے والی جنگ کی سختیوں کو چیلنج کیا۔ اس عمل نے نہ صرف جویریہ (رضي الله عنها) کی آزادی حاصل کی بلکہ قیدیوں کے ساتھ عزت اور احترام کے ساتھ سلوک کرنے کی ایک مثال بھی قائم کی۔\n\nامن کی بحالی:\u2000 جویریہ (رضي الله عنها) سے نکاح کرنے سے مسلمان کمیونٹی اور بنو مصطلق قبیلے کے درمیان امن قائم کرنے میں مدد ملی۔ نبی اکرم ﷺ کے گھر میں ان کی نئی حیثیت نے تناؤ کو کم کرنے اور صلح کو فروغ دینے میں اہم کردار ادا کیا۔ نبی اکرم صلی اللہ علیہ وسلم سے جویریہ (رضي الله عنها) کے نکاح نے برادری کے اندر ان کے سماجی مقام کو بہت بلند کر دیا۔ وہ نبی اکرم ﷺ کی دوسری بیویوں کے ساتھ "أم المؤمنين" (ام المؤمنین) کے نام سے جانی جانے لگیں۔\n\nعقیدت مند زندگی:\u2000 جویریہ (رضي الله عنها) ایک پرہیزگار اور عقیدت مند خاتون تھیں۔ انہوں نے مسلم کمیونٹی میں سرگرم کردار ادا کیا اور انہیں کچھ احادیث (نبی ﷺ کی اقوال اور روایات) کی روایت کا سہرا بھی دیا جاتا ہے۔ جويرية بنت الحارث (رضي الله عنها) کی کہانی رحم کی تبدیلی کی طاقت اور  سب سے مشکل حالات میں بھی مثبت تبدیلی کے امکان کی ایک مضبوط دلیل ہے۔\n',
    'ميمونہ بنت الحارث (رضي الله عنها) رسول اکرم صلی اللہ علیہ وسلم کی ان بیویوں میں سے ایک ہیں جنہوں نے آپ کی زندگی میں بعد کے دور میں نکاح کیا۔ تاریخی روایات انہیں ایک غیر معمولی مہربانی اور پرہیزگاری والی خاتون کے طور پر پیش کرتی ہیں جنہوں نے نبی اکرم ﷺ کو آپ کے آخری سالوں میں انمول صحبت اور سہارا فراہم کیا۔\n\nنکاح: \u2000 سنہ 7ھ مطابق 628ء میں رسول اللہ صلی اللہ علیہ وآلہ وسلم عمرۃ القضا کی ادائیگی کے لیے مکہ مکرمہ تشریف لائے۔ تو سیدہ میمونہ رضی اللہ عنہا مسلمانوں کی اِس ہیبت کو دیکھ کر حیران ہوئیں اور انھیں رسول اللہ صلی اللہ علیہ وآلہ وسلم سے قلبی لگاؤ پیدا ہو گیا۔ انھوں نے اِس موضوع کو اپنی بہن اُم الفضل لبابہ بنت حارث کے سامنے رکھا (جو رسول اللہ صلی اللہ علیہ وسلم کی چچی بھی تھیں)۔ تو انھوں نے اپنے شوہر عباس بن عبد المطلب سے اِس رشتہ کے لیے درخواست کی۔ عباس بن عبد المطلب نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے اِس بات کا اِظہار کیا تو رسول اللہ صلی اللہ علیہ وسلم نے جعفر بن ابی طالب کو اِس خواستگاری کے لیے بھیجا۔ جب رسول اللہ صلی اللہ علیہ وسلم کی جانب سے انھیں نکاح کا پیغام پہنچا تو وہ اُس وقت اونٹ پر سوار تھیں۔ اُس وقت انھوں نے خوشی سے کہا: ’’اونٹ اور اُس کا سوار، اُن کے خدا اور اُن کے رسول کی یاد میں ہیں‘‘۔\n\nسیدہ میمونہ رضی اللہ عنہا نے اپنی شادی کا اِختیار عباس بن عبدالمطلب (رضی اللہ عنہ) کے سپرد کر دیا جنھوں نے مکہ مکرمہ سے دس میل کے فاصلے پر واقع مقامِ سَرَف پر آپ کا نکاح رسول اللہ صلی اللہ علیہ وسلم سے کر دیا تھا۔ اور چار سو درہم حق مہر اور ایک روایت کے مطابق پانچ سو درہم  حق مہر قرار دیا۔ کہا گیا ہے کہ آپ نے خود کو بطور ہبہ ثابت کیا اور رسول اللہ صلی اللہ علیہ و آلہ وسلم سے مہر کا تقاضا نہیں کیا۔ قدِ نکاح کے بعد رسول اللہ صلی اللہ علیہ وسلم نے مہمانوں کی دعوت کا اِرداہ کیا جس میں آپ سیدہ میمونہ (رضی اللہ عنہا) کے رِشتے داروں کو مدعو کرسکیں لیکن قریش اِس بات پر آمادہ نہ ہوئے کیونکہ انھوں نے آپ کو یاد دہانی کروائی کہ عمرۃ القضا کے موقع پر آپ کو مکہ مکرمہ میں تین دِن رہنے کی اجازت تھی۔ اَب وہ مدت ختم ہو گئی تو اِس بنا پر رسول اللہ صلی اللہ علیہ و آلہ وسلم مکہ مکرمہ سے باہر نکل گئے۔ اور جب آپ صلی اللہ علیہ و آلہ وسلم مکہ مکرمہ سے باہر چلے گئے تو اپنے غلام ابو رافع (رضی اللہ عنہ) کو حکم دِیا کہ وہ حضرت میمونہ (رضی اللہ عنہا) کو مکہ مکرمہ سے لے آئیں۔ ابو رافع آپ کو رسول اللہ صلی اللہ علیہ وسلم کے پاس مقامِ سَرَف لے کر پہنچے جہاں رسم عروسی اداء ہوئی۔ یہ رسول اللہ صلی اللہ علیہ وسلم کا آخری نکاح تھا اور سیدہ میمونہ (رضی اللہ عنہا) آپ کی آخری بیوی تھیں۔ یہاں سے آپ رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ مدینہ منورہ تشریف لے گئیں۔\n\nخاموشی سے عقیدت کی زندگی:\u2000 ميمونہ (رضي الله عنها) کی شخصیت اور تجربات کے بارے میں معلومات محدود ہیں۔ تاہم، تاریخی روایات انہیں مسلسل ایک مہربان اور پرہیزگار خاتون کے طور پر بیان کرتی ہیں۔ انہوں نے نبی اکرم ﷺ کی خدمت اور ایک پرسکون اور خوشگوار گھریلو ماحول میں حصہ لینے میں تسلی اور مقصد پایا ہو گا۔\n\nسہارے کی میراث: \u2000 ميمونہ (رضي الله عنها) کی اہمیت اس خاموش لیکن انتہائی اہم کردار میں ہے جو انہوں نے نبی اکرم صلی اللہ علیہ وسلم کی زندگی میں ادا کیا۔ ان کی موجودگی نے اس وقت میں ان کو جذباتی سہارا اور صحبت فراہم کی جب مسلم کمیونٹی ترقی کر رہی تھی اور نئے چیلنجوں کا سامنا کر رہی تھی۔\n',
    ' صفیہ بنت حیی (رضي الله عنها) اسلامی تاریخ میں ایک منفرد مقام رکھتی ہیں۔ ان کا سفر، اسلام کی مخالف ایک یہودی قبیلے کی رکن ہونے سے نبی اکرم صلی اللہ علیہ وسلم کی بیوی بننے تک، مصالحت اور مختلف مذاہب کے درمیان تفہیم کی صلاحیت کی ایک مضبوط علامت کے طور پر کام کرتا ہے۔\n\nمخالف سمتوں سے: \u2000صفیہ بنت حیی (رضي الله عنها) بنی نضیر سے تعلق رکھتی تھیں، جو مدینہ میں رہنے والا ایک یہودی قبیلہ تھا۔ اس قبیلے نے ابتدائی طور پر مسلم کمیونٹی کے ساتھ پرامن بقائے باہمی سے لطف اندوز کیا۔ تاہم، کشیدگی پیدا ہو گئی اور بنی نضیر آخر کار اسلام کی مخالفت کا باعث بن گیا۔ مسلمان کمیونٹی اور بنی نضیر کے درمیان ایک فوجی مقابلہ ہوا، جس کے نتیجے میں صفیہ (رضي الله عنها) اور اس کے قبیلے کے دیگر افراد قیدی بنا لیے گئے۔ یہ واقعہ ہجرت کے ساتویں سال خیبر کی مہم کے دوران ہوا تھا۔\n\nایک غیر متوقع موڑ:\u2000 قیدی بننے کے بعد، روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے صفیہ (رضي الله عنها) کو اسلام قبول کرنے کی صورت میں اس کی آزادی کی پیشکش کی۔ وہ اس تجویز پر راضی ہوگئیں اور اسلام قبول کر لیا۔ پھر نبی اکرم صلی اللہ علیہ وسلم نے ان سے نکاح کا پیغام بھیجا اور وہ اس پر بھی راضی ہوگئیں۔ صفیہ (رضي الله عنها) کا نبی اکرم صلی اللہ علیہ وسلم سے نکاح صرف ذاتی معاملے سے بڑھ کر تھا۔ یہ مسلمانوں اور یہودی برادری کے درمیان صلح کی ایک مضبوط علامت کے طور پر کام کرتا تھا۔ یہ اتحاد ماضی کے تنازعات کے باوجود، پرامن بقائے باہمی اور حتیٰ قریبی رشتے استوار کرنے کی صلاحیت کا مظاہرہ کرتا ہے۔\n\nعقیدت مند زندگی:\u2000 صفیہ (رضي الله عنها) ایک پرہیزگار اور عقیدت مند خاتون تھیں۔ انہوں نے مسلم کمیونٹی میں سرگرم کردار ادا کیا اور انہیں کچھ احادیث (نبی ﷺ کی اقوال اور روایات) کی روایت کا سہرا بھی دیا جاتا ہے۔ صفیہ بنت حیی (رضي الله عنها) کی کہانی امید کا پیغام اور اختلافات پر قابو پانے کی صلاحیت پیش کرتی ہے۔ ان کی زندگی مختلف کمیونٹیز کے درمیان مکالمے، تفہیم اور پل بنانے کی اہمیت کی یاد دلاتی ہے۔\n',
    'رملة بنت ابو سفيان (رضي الله عنها)، جنہیں ام حبيبة کے نام سے بھی جانا جاتا ہے، اسلامی تاریخ میں ایک دلچسپ شخصیت ہیں۔ ان کی زندگی کی کہانی ابتدائی اسلام کی جدوجہد سے جڑی ہوئی ہے، جو ان کے ایمان کی مضبوطی اور نبی اکرم صلی اللہ علیہ وسلم کی مسلمان کمیونٹی کی تعمیر کے لیے حکمت عملی پر مبنی غور و فکر کو ظاہر کرتی ہے۔\n\nایک ممتاز مخالف کی بیٹی: \u2000 رملا (رضي الله عنها) مکہ کے طاقتور قبیلے قریش میں پیدا ہوئیں۔ ان کے والد، ابو سفیان بن حرب، نبی اکرم صلی اللہ علیہ وسلم اور ابھرتی ہوئی مسلم کمیونٹی کے سخت مخالف تھے۔ اسلام کے ابتدائی سالوں میں، قریش نے مسلمانوں پر ظلم و ستم ڈھایا، جس سے نئے مذہب کو قبول کرنے والوں کے لیے زندگی مشکل ہو گئی۔\n\nایمان کے لیے انتخاب: \u2000اپنے والد کی مخالفت کے باوجود، رملہ (رضي الله عنها) نے اپنے پہلے شوہر، عبیداللہ بن جحش کے ساتھ اسلام قبول کر لیا۔ اس فیصلے نے انہیں اپنے خاندانوں اور غالب سماجی نظام سے الگ کر دیا۔ مکہ میں ظلم و ستم کا سامنا کرتے ہوئے، وہ پناہ لینے کے لیے حبشہ ہجرت کرنے والے مسلمانوں کے ایک گروہ میں شامل ہوگئیں۔\n\nنقصان اور راستے میں تبدیلی: \u2000حبشہ میں رہتے ہوئے، عبیداللہ عیسائیت قبول کر گئے اور بعد ازاں ان کا انتقال ہوگیا۔ تاہم، رملہ (رضي الله عنها) اپنے اسلامی عقیدے پر قائم رہیں۔ ایک چھوٹے بچے کے ساتھ بیوہ ہونے کی وجہ سے، انہیں ایک اجنبی سرزمین میں نامعلوم مستقبل کا سامنا کرنا پڑا۔\n\nایک حکمت عملی پر مبنی تجویز:\u2000 رملہ (رضي الله عنها) کی حالت کی خبر مکہ میں نبی اکرم صلی اللہ علیہ وسلم تک پہنچی۔ ان کی استقامت اور قریش قبیلے کے ساتھ روابط مضبوط بنانے کے امکان کو تسلیم کرتے ہوئے، نبی اکرم صلی اللہ علیہ وسلم نے ایک قاصد کے ذریعے بھیجے گئے خط کے ذریعے ان سے نکاح کا پیغام بھیجا۔ اس تجویز میں ذاتی اور حکمت عملی دونوں طرح کی اہمیت تھی۔\n\nمتعدد مقاصد کے ساتھ ایک رشتہ:\u2000 رملہ (رضي الله عنها) کا نبی اکرم صلی اللہ علیہ وسلم سے نکاح کئی مقاصد کو پورا کرتا تھا:\n\nذاتی تحفظ: \u2000یہ نکاح رملہ (رضي الله عنها) اور ان کے بچے کے لیے بہت ضروری تحفظ اور سہولت فراہم کرتا تھا۔ اس نے انہیں عرب واپس جانے اور مسلم کمیونٹی میں دوبارہ شامل ہونے کی اجازت دی۔\n\nکمیونٹیز کے درمیان ایک پل:\u2000 یہ اتحاد مسلمانوں اور قریش قبیلے کے درمیان تعلقات میں نرمی کی ایک ممکنہ نشانی تھا۔ یہ ماضی کے تنازعات کے باوجود نبی اکرم صلی اللہ علیہ وسلم کی پل بنانے کی رضامندی کا مظاہرہ کرتا ہے۔\n\nامت کی مضبوطی:\u2000 رملہ (رضي الله عنها) سے نکاح کرکے، نبی اکرم صلی اللہ علیہ وسلم ایک طاقتور قبیلے کی ایک ممتاز خاتون کو اسلام کے میں لے آئے۔ اس نے ابھرتے ہوئے مسلم کمیونٹی کو مضبوط کیا اور دوسرے لوگوں کے لیے جو اسلام قبول کرنے پر غورکر رہے تھے، ایک مثبت مثال پیش کی۔\n\nعقیدت مند زندگی:\u2000 رملہ (رضي الله عنها) ایک پرہیزگار اور عقیدت مند خاتون تھیں۔ وہ ایک وفادار بیوی بنی رہیں اور مدینہ ہجرت کرنے کے بعد مسلم کمیونٹی میں سرگرم عمل رہیں۔ رملہ بنت ابی سفیان (رضی اللہ عنہا) کی کہانی ابتدائی مسلمانوں کو درپیش چیلنجوں اور کامیابیوں کی مثال دیتی ہے۔ یہ اسلام کے قیام میں ایمان، لچک اور حکمت عملی کی اہمیت کو اجاگر کرتا ہے۔\n',
  ];
  final List<String> childrenUrduText = [
    'عام رائے یہ ہے کہ حضرت محمد صلی اللہ علیہ وسلم کے تین بیٹے تھے جن کے نام عبداللہ، ابراہیم اور قاسم تھے اور چار بیٹیاں جن کے نام فاطمہ، رقیہ، ام کلثوم اور زینب رضی اللہ عنہا تھے۔ کہا جاتا ہے کہ حضرت محمد صلی اللہ علیہ وسلم کی اولاد ان کی پہلی بیوی خدیجہ بنت خویلد رضی اللہ عنہا سے پیدا ہوئی، سوائے ان کے بیٹے ابراہیم کے، جو ماریہ القبطیہ رضی اللہ عنہا کے ہاں پیدا ہوئے۔ حضرت محمد صلی اللہ علیہ وسلم کے بیٹے میں سے کوئی بھی بالغ نہیں ہوا لیکن ان کا ایک بالغ رضاعی بیٹا زید بن حارثہ رضی اللہ عنہ تھا۔ حضرت محمد صلی اللہ علیہ وسلم کی تمام بیٹیاں جوانی کو پہنچ گئیں لیکن صرف فاطمہ رضی اللہ عنہا اپنے والد سے بچ گئیں۔\n',
    'قاسم بن محمد صلی اللہ علیہ وسلم حضرت محمد صلی اللہ علیہ وسلم اور خدیجہ بنت خویلد (رضی اللہ عنہا) کے بیٹوں میں سب سے بڑے تھے۔ ان کا انتقال 601 عیسوی میں ہوا (609 میں اپنے والد کی نبوت کے آغاز سے پہلے)، ان کی تیسری سالگرہ کے بعد، اور انہیں جنت المؤلّہ قبرستان، مکہ میں دفن کیا گیا۔ ابن ماجہ نے ذکر کیا ہے کہ ان کی وفات دودھ کی عمر پوری ہونے سے پہلے ہوئی۔\n',
    'عبداللہ بن محمد صلی اللہ علیہ وسلم جنہیں الطاہر (خالص) اور الطیب (اچھا) کے نام سے بھی جانا جاتا ہے۔ حضرت محمد (ص) اور خدیجہ (رض) کے بیٹوں میں سے ایک تھے۔ ان کا انتقال بچپن میں ہوا۔ عبداللہ (رضی اللہ عنہ) کی پیدائش 611 کے لگ بھگ ہوئی۔ وہ حضرت محمد صلی اللہ علیہ وسلم اور خدیجہ (رض) کے سب سے چھوٹے بچے تھے۔ حضرت محمد صلی اللہ علیہ وسلم نے انہیں اپنے والد کا نام دیا۔ عبداللہ (رضی اللہ عنہ) کی وفات 4 سال کی عمر میں 615 عیسوی میں ہوئی۔\n',
    'ابراہیم بن محمد صلی اللہ علیہ وسلم حضرت محمد صلی اللہ علیہ وسلم اور ماریہ القبطیہ (رضی اللہ عنہا) کے بیٹے تھے۔\n\nپیدائش، بیماری اور موت:\u2000 ابن کثیر، ابن سعد کے حوالے سے نقل کرتے ہیں کہ ابراہیم (رضی اللہ عنہ) سنہ 8 ہجری کے آخری مہینے یعنی 630 عیسوی کے برابر پیدا ہوئے۔ بچے کا نام ابراہیم (یا عربی میں ابراہیم) کے نام پر رکھا گیا تھا جس کی یہودی، عیسائی اور مسلم روایات میں تعظیم کی جاتی تھی۔ ابراہیم (رضی اللہ عنہ) کو ام سیف نامی نرس کی دیکھ بھال میں رکھا گیا تھا، جو ابو سیف، لوہار کی بیوی تھی، جسے حضرت محمد صلی اللہ علیہ وسلم نے دودھ کی فراہمی کو پورا کرنے کے لیے بکریاں تحفے میں دیں۔ جب ابراہیم (رضی اللہ عنہ) بیمار ہوئے تو انہیں اپنی اور اپنی بہن سیرین کی دیکھ بھال میں اپنی والدہ کے گھر کے قریب کھجور کے باغ میں منتقل کردیا گیا۔ جب یہ واضح ہو گیا کہ ابراہیم (رضی اللہ عنہ) کے زندہ رہنے کا امکان نہیں ہے، تو حضرت محمد صلی اللہ علیہ وسلم کو اطلاع دی گئی۔ اس خبر پر ان کا ردعمل اس طرح بتایا جاتا ہے:\n\nاسے اس خبر سے اتنا صدمہ ہوا کہ اس نے محسوس کیا کہ اس کے گھٹنے اب اسے اٹھا نہیں سکتے اور عبدالرحمٰن بن عوف (رضی اللہ عنہ) سے کہا کہ وہ اس پر ٹیک لگانے کے لیے اپنا ہاتھ دیں۔ وہ فوراً باغ کی طرف بڑھا اور اپنی ماں کی گود میں مرنے والے بچے کو الوداع کرنے کے لیے وقت پر پہنچا۔ رسول اللہ صلی اللہ علیہ وسلم نے بچے کو لیا اور ہاتھ ملاتے ہوئے اسے اپنی گود میں بٹھا لیا۔ اس کا دل نئے سانحے سے پھٹ گیا تھا، اور اس کا چہرہ اس کے اندرونی درد کی عکاسی کر رہا تھا۔ غم سے دم گھٹتے ہوئے اس نے اپنے بیٹے سے کہا کہ اے ابراہیم (رضی اللہ عنہ) اللہ کے فیصلے کے خلاف ہم تمہارے کچھ کام نہیں آسکتے، پھر خاموش ہوگئے۔ اس کی آنکھوں سے آنسو جاری ہو گئے۔ بچہ دھیرے دھیرے گم ہو گیا، اور اس کی ماں اور خالہ مسلسل روتی رہیں، اور حضرت محمد صلی اللہ علیہ وسلم نے انہیں کبھی رکنے کا حکم نہیں دیا۔ جیسے ہی ابراہیم (رضی اللہ عنہ) نے موت کے سامنے ہتھیار ڈال دیے، رسول اللہ صلی اللہ علیہ وسلم کی امید جس نے انہیں تھوڑی دیر کے لیے تسلی دی تھی جب کہ مکمل طور پر چکنا چور ہوگیا۔ آنکھوں میں آنسو لیے اس نے ایک بار پھر مردہ بچے سے بات کی: "اے ابراہیم (رضی اللہ عنہ)، اگر سچائی کو یقین نہ تھا کہ ہم میں سے آخری لوگ پہلے کے ساتھ شامل ہوں گے، تو ہم اب سے بھی زیادہ تم پر ماتم کرتے۔" ایک لمحے کے بعد فرمایا: "آنکھیں آنسو بہاتی ہیں اور دل غمگین ہے، لیکن ہم کچھ نہیں کہتے سوائے اس کے جس سے ہمارا اللہ راضی ہو، بے شک اے ابراہیم (رضی اللہ عنہ)، آپ کے جانے سے ہم غم زدہ ہیں۔\n\nچاند گرہن کا واقعہ:\u2000 ابن کثیر نے اپنی کتاب البدایہ والنہایہ میں ذکر کیا ہے کہ ابراہیم علیہ السلام کی وفات جمعرات 10 ربیع الاول 10 ہجری کو ہوئی اور ان کی وفات کے عین بعد اسی دن سورج گرہن ہوا۔ اس کی وجہ سے مبصرین کا خیال تھا کہ اللہ سورج کو گرہن لگا کر اپنے نبی سے تعزیت کر رہا ہے۔ حضرت محمد صلی اللہ علیہ وسلم یہ نہیں چاہتے تھے کہ ان کے ساتھی ان پر یا ان کے بیٹے کو الوہیت کا دعویٰ کر کے فتنے میں پڑ جائیں، مسجد میں کھڑے ہوئے اور فرمایا: سورج اور چاند کو کسی کی موت یا زندگی (یعنی پیدائش) کی وجہ سے گرہن نہیں لگتا۔ جب تم سورج گرہن دیکھو تو اللہ سے دعا کرو۔ جدید فلکیاتی جدولوں کے مطابق 27 جنوری 632 کو ایک سورج گرہن ہوا جو مدینہ سے نظر آیا۔\n\nتدفین:\u2000 حضرت محمد صلی اللہ علیہ وسلم نے ماریہ اور سیرین کو اطلاع دی تھی کہ ابراہیم (رضی اللہ عنہ) کی جنت میں اپنی نرس ہوگی۔ مختلف روایتوں میں بتایا گیا ہے کہ ابراہیم کا غسل ام بردہ یا الفضل ابن عباس رضی اللہ عنہما نے تدفین کی تیاری میں کیا تھا۔ اس کے بعد حضرت محمد صلی اللہ علیہ وسلم ، ان کے چچا حضرت عباس (رضی اللہ عنہ) اور دیگر لوگوں کے ذریعہ ان کو تھوڑی سی بیئر پر قبرستان لے جایا گیا۔ ان کی تدفین کی گئی۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے قبر کو ریت سے بھر دیا، اس پر تھوڑا سا پانی چھڑکا اور اس پر ایک نشان لگا دیا، اور فرمایا کہ قبروں کے پتھر نہ تو اچھا کام کرتے ہیں اور نہ ہی برائی، لیکن یہ زندہ لوگوں کو راحت بخشتے ہیں، انسان جو کچھ بھی کرتا ہے، اللہ تعالیٰ اس کی بھلائی چاہتا ہے۔\n',
    'زینب بنت محمد صلی اللہ علیہ وسلم ان کی پہلی بیوی خدیجہ رضی اللہ عنہا کی سب سے بڑی بیٹی تھیں۔\n\nشادی:\u2000 اس نے دسمبر 610 سے پہلے اپنے خالہ زاد بھائی ابو العاص بن الربیع سے شادی کی اور خدیجہ رضی اللہ عنہا نے انہیں ایک سلیمانی ہار کا تحفہ دیا۔ ان کے دو بچے تھے، بیٹا علی، جو بچپن میں ہی فوت ہو گئے تھے، اور بیٹی امامہ، جن سے بچے پیدا ہوۓ، جن میں ہلال یا محمد الاوسط شامل ہیں۔ حضرت محمد صلی اللہ علیہ وسلم کے سب سے پہلے نبی ہونے کے فوراً بعد زینب رضی اللہ عنہا مسلمان ہو گئیں۔ قریش نے ابو العاص پر زینب (رضی اللہ عنہا) کو طلاق دینے کے لیے دباؤ ڈالا، اور کہا کہ وہ اس کے بدلے میں ان کو جو عورت پسند کریں گے، دیں گے، لیکن ابو العاص نے کہا کہ وہ کوئی دوسری عورت نہیں چاہتے، ایسا موقف جس کے لیے حضرت محمد صلی اللہ علیہ وسلم نے اس کی تعریف کی. حضرت محمد صلی اللہ علیہ وسلم کا مکہ پر کوئی دائرہ اختیار نہیں تھا اور اس لیے وہ انہیں علیحدہ ہونے پر مجبور نہیں کر سکتے تھے، اس لیے ابو العاص کے اسلام قبول کرنے سے انکار کے باوجود وہ ایک ساتھ رہتے رہے۔ حضرت زینب رضی اللہ تعالیٰ عنہا مکہ میں ہی رہیں جب حضرت محمد صلی اللہ علیہ وسلم کے بعد دوسرے مسلمان مدینہ ہجرت کر گئے۔\n\nموت:\u2000 ان کی مصالحت قلیل مدتی تھی، کیونکہ زینب (رضی اللہ عنہا) کا انتقال مئی یا جون 629 میں ہوا۔ ان کی موت کی وجہ اسقاط حمل کی پیچیدگیوں کی وجہ سے تھی جو انھیں 624 میں لاحق ہوئی تھیں۔ جن خواتین نے ان کے میت کو غسل دیا ان میں سودہ رضی اللہ عنہا، ام سلمہ رضی اللہ عنہا اور ام ایمن (رضی اللہ عنہا) بھی شامل تھیں۔\n',
    'رقیہ بنت محمد اسلامی حضرت محمد صلی اللہ علیہ وسلم اور خدیجہ (رض) کی دوسری بڑی بیٹی تھیں۔ اس نے تیسرے خلیفہ عثمان (رضی اللہ عنہ) سے شادی کی اور اس جوڑے کا ایک بیٹا عبد اللہ پیدا ہوا۔ 624 میں رقیہ رضی اللہ عنہا کا انتقال بیماری سے ہوا۔\n\nابتدائی زندگی:\u2000 601 یا 602 عیسوی کے لگ بھگ مکہ میں پیدا ہوئیں، رقیہ رضی اللہ عنہا حضرت محمد صلی اللہ علیہ وسلم اور ان کی پہلی بیوی خدیجہ رضی اللہ عنہا کی تیسری اولاد اور دوسری بیٹی تھیں، جو ایک کامیاب تاجر بھی تھیں۔\n\nازدواجی زندگی:\u2000 عتبہ سے شادی:\u2000 ان کی شادی اگست 610 سے پہلے عتبہ ابن ابی لہب سے ہوئی تھی، لیکن یہ شادی کبھی مکمل نہیں ہوئی۔ رقیہ رضی اللہ عنہا اس وقت مسلمان ہوئیں جب ان کی والدہ مسلمان ہوئیں تھیں۔ جب حضرت محمد صلی اللہ علیہ وسلم نے 613 میں کھلے عام تبلیغ شروع کی تو قریش نے حضرت محمد صلی اللہ علیہ وسلم کو یاد دلایا کہ انہوں نے "ان کی بیٹیوں کی دیکھ بھال سے انہیں فارغ کر دیا ہے" اور انہیں واپس کرنے کا فیصلہ کیا تاکہ وہ خود ان کی کفالت کریں۔ انہوں نے عتبہ سے کہا کہ اگر وہ رقیہ (رضی اللہ عنہا) کو طلاق دے دے تو وہ اسے "ابان بن سعید بن العاص کی بیٹی یا سعید بن العاص کی بیٹی" دیں گے۔ جب حضرت محمد صلی اللہ علیہ وسلم نے ابو لہب کو خبردار کیا کہ وہ جہنم میں جائے گا، ابو لہب نے کہا کہ وہ اپنے بیٹے سے دوبارہ کبھی بات نہیں کرے گا جب تک کہ وہ رقیہ رضی اللہ عنہا کو طلاق نہ دے دے، جو کہ عتبہ نے اس کے مطابق کیا۔\n\nعثمان رضی اللہ عنہ سے شادی:\u2000 615 میں رقیہ کی شادی ایک ممتاز مسلمان، عثمان بن عفان رضی اللہ عنہ سے ہوئی۔ وہ حبشہ کی پہلی ہجرت پر اس کے ساتھ گئی، جہاں اسے اسقاط حمل کا سامنا کرنا پڑا۔ وہ حبشہ واپس آئے اور وہاں رقیہ رضی اللہ عنہ نے 619ء میں ایک بیٹے عبداللہ رضی اللہ عنہ کو جنم دیا۔ اس کی مزید کوئی اولاد نہیں تھی۔ عثمان رضی اللہ عنہ اور رقیہ رضی اللہ عنہ ان لوگوں میں سے تھے جو 619 میں مکہ واپس آئے۔ عثمان رضی اللہ عنہ نے 622 میں مدینہ ہجرت کی، اور رقیہ رضی اللہ عنہ نے بعد میں ان کی پیروی کی۔ جب اسامہ بن زید رضی اللہ عنہ کو کسی کام پر ان کے گھر بھیجا گیا تو انہوں نے خود کو ان کی طرف اور باری باری عثمان رضی اللہ عنہ کو گھورتے ہوئے پایا۔ حضرت محمد صلی اللہ علیہ وسلم نے اسامہ رضی اللہ عنہ سے پوچھا کہ کیا تم نے ان دونوں سے زیادہ خوبصورت جوڑا کبھی دیکھا ہے؟ اور اس نے اتفاق کیا کہ اس نے ایسا نہیں دیکھا۔\n\nحضرت رقیہ (رض) مارچ 624ء میں بیمار ہوئیں۔ حضرت عثمان (رض) کو ان کی دیکھ بھال کے لیے فوجی خدمات سے معاف کر دیا گیا۔ اس مہینے کے آخر میں، 17 رمضان المبارک کو اس دن وہ انتقال کر گئیں، جس دن حضرت زید بن حارثہ (رض) غزوہ بدر کی فتح کی خبر لے کر مدینہ واپس آئے تھے۔ جب حضور نبی اکرم ﷺ جنگ کے بعد مدینہ واپس تشریف لائے تو اہل خانہ ان کی قبر پر فاتحہ خوانی کے لیے گئے۔\n',
    'ام کلثوم بنت محمد حضرت محمد صلی اللہ علیہ وسلم کی پہلی بیوی خدیجہ بنت خویلد رضی اللہ عنہا کی تیسری بیٹی تھیں۔\n\nاسلام قبول کرنا:\u2000 وہ مکہ میں پیدا ہوئیں، غالباً ان کے چھ بچوں میں سے پانچویں تھیں۔ اس کی شادی اگست 610 سے پہلے عتیبہ ابن ابی لہب سے ہوئی تھی، لیکن یہ شادی کبھی پوری نہیں ہوئی۔ وہ ابھی تک اپنے والدین کے ساتھ رہ رہی تھی جب حضرت محمد صلی اللہ علیہ وسلم نے سب سے پہلے خود کو نبی قرار دیا، اور ام کلثوم رضی اللہ عنہا اپنی والدہ کے فوراً بعد مسلمان ہو گئیں۔\n\nچھ سو تیرہ میں جب حضرت محمد صلی اللہ علیہ وسلم نے ابو لہب کو جہنم کی آگ سے خبردار کیا تو ابو لہب نے عتیبہ سے کہا کہ جب تک وہ ام کلثوم رضی اللہ عنہا کو طلاق نہ دے دے وہ اس سے دوبارہ کبھی بات نہیں کرے گا۔ ان کے ماموں بھائی ہند ابن ابی ہالہ نے حضرت محمد صلی اللہ علیہ وسلم سے پوچھا کہ آپ نے ام کلثوم رضی اللہ عنہا کو عتیبہ سے الگ کیوں کیا؟ حضرت محمد صلی اللہ علیہ وسلم نے جواب دیا کہ اللہ نے مجھے اجازت نہیں دی کہ میں اس کا نکاح ایسے شخص سے کروں جو جنت میں جانے والا نہیں۔\n\nستمبر 622 میں حضرت محمد صلی اللہ علیہ وسلم مکہ سے روانہ ہوئے۔ کچھ ہی دیر پہلے زید بن حارثہ رضی اللہ عنہ نے ام کلثوم رضی اللہ عنہا اور ان کی بہن فاطمہ رضی اللہ عنہا کو مدینہ میں اپنے والد سے ملنے کی ہدایت کی۔ ان کے چچا العباس نے انہیں اونٹ پر بٹھایا۔ لیکن جب وہ روانہ ہورہے تھے تو حویرث بن نقیض نے جانور کو اتنا آگے بڑھایا کہ اس نے انہیں زمین پر پھینک دیا۔ تاہم ام کلثوم رضی اللہ عنہا اور فاطمہ رضی اللہ عنہا بحفاظت مدینہ پہنچ گئیں۔ حضرت محمد صلی اللہ علیہ وسلم کو یہ حملہ یاد تھا اور جب انہوں نے 630 میں مکہ فتح کیا تو انہوں نے حویرث کو موت کی سزا سنائی۔\n\nوفات:\u2000 ام کلثوم رضی اللہ عنہا کا انتقال نومبر/دسمبر 630ء میں ہوا۔ ان کے والد نے روتے ہوئے ان کی نماز جنازہ پڑھائی۔ پھر علی، اسامہ بن زید اور ابو طلحہ رضی اللہ عنہ نے اسے قبر میں ڈال دیا۔ حضرت محمد صلی اللہ علیہ وسلم نے فرمایا کہ اگر میری دس بیٹیاں ہوتیں تو میں ان سب کی شادی عثمان رضی اللہ عنہ سے کر دیتا۔ عثمان (رضی اللہ عنہ) کو ذو النورین ("دو نوروں کے مالک") کے نام سے جانا جاتا تھا کیونکہ یہ خیال کیا جاتا تھا کہ کسی دوسرے آدمی نے نبی صلی اللہ علیہ وسلم کی دو بیٹیوں سے شادی نہیں کی تھی۔\n',
    'فاطمہ بنت محمد صلی اللہ علیہ وسلم جسے عرف عام میں فاطمہ الزہرا (رضی اللہ عنہا) کے نام سے جانا جاتا ہے، حضرت محمد صلی اللہ علیہ وسلم اور ان کی اہلیہ خدیجہ (رضی اللہ عنہا) کی بیٹی تھیں۔ فاطمہ رضی اللہ عنہا کے شوہر حضرت علی رضی اللہ عنہ تھے، جو خلفائے راشدین میں سے چوتھے تھے۔ فاطمہ رضی اللہ عنہا کے بیٹے حسن رضی اللہ عنہ اور حسین رضی اللہ عنہ تھے۔ حضرت محمد صلی اللہ علیہ وسلم کے بارے میں کہا جاتا ہے کہ وہ انہیں عورتوں میں سب سے افضل اور اپنے لیے سب سے پیاری شخصیت قرار دیتے تھے۔ وہ اکثر مسلم خواتین کے لیے ایک بہترین نمونہ اور ہمدردی، مصائب کو برداشت کرنےکی ایک مثال کے طور پر دیکھی جاتی ہیں۔ حضرت فاطمہ رضی اللہ عنہا کی بدولت حضرت محمد صلی اللہ علیہ وسلم کا خاندانی سلسلہ آج تک قائم ہے۔ اس کا نام اور اس کے حروف مسلم لڑکیوں کے لیے مقبول انتخاب ہیں۔\n\nپیدائش:\u2000 فاطمہ رضی اللہ عنہا مکہ میں حضرت خدیجہ رضی اللہ عنہا کے ہاں پیدا ہوئیں، جو حضرت محمد صلی اللہ علیہ وسلم کی پہلی ازواج مطہر تھیں۔ خدیجہ (رضی اللہ عنہا) نے 605 عیسوی میں فاطمہ کو جنم دیا، 50 سال کی عمر میں، پہلی قرآنی آیات سے پانچ سال پہلے۔ اس کا مطلب یہ ہے کہ فاطمہ رضی اللہ عنہا کی عمر شادی کے وقت اٹھارہ سال سے زیادہ تھی جو کہ عرب میں غیر معمولی بات تھی۔ تاہم بارہ ذرائع بتاتے ہیں کہ فاطمہ رضی اللہ عنہا تقریباً 612 یا 615 عیسوی میں پیدا ہوئیں، جب خدیجہ رضی اللہ عنہا کی عمر کچھ زیادہ ہو چکی ہو گی۔ سنّی ابن سعد نے اپنی کتاب الطبقات الکبریٰ میں بیان کیا ہے کہ حضرت فاطمہ رضی اللہ عنہا کی پیدائش اس وقت ہوئی جب حضرت محمد صلی اللہ علیہ وسلم کی عمر تقریباً پینتیس سال تھی۔\n\nفاطمہ رضی اللہ عنہا کی پرورش مکہ میں ہوئی جب کہ حضرت محمد صلی اللہ علیہ وسلم اور ان کے چند پیروکاروں کو کفار کے ناروا سلوک کا سامنا کرنا پڑا۔ ایک موقع پر وہ حضرت محمد صلی اللہ علیہ وسلم کی مدد کے لیے پہنچیں جب ابوجہل نے حضرت محمد صلی اللہ علیہ وسلم کے دشمن اور مشرک کے اکسانے پر آپ صلی اللہ علیہ وسلم پر گندگی ڈالی ۔ فاطمہ رضی اللہ عنہا نے بچپن میں اپنی والدہ خدیجہ رضی اللہ عنہا کو کھو دیا۔ جب خدیجہ رضی اللہ عنہا کا انتقال ہوا تو کہا جاتا ہے کہ جبرائیل علیہ السلام حضرت فاطمہ رضی اللہ عنہا کو تسلی دینے کے لیے پیغام لے کر حضرت محمد صلی اللہ علیہ وسلم پر نازل ہوئے۔\n\nوفات:\u2000 حضرت فاطمہ رضی اللہ عنہا کا انتقال 11/632 میں، حضرت محمد صلی اللہ علیہ وسلم کی وفات کے چھ ماہ کے اندر ہوا۔ اس کی عمر 18 یا 27 سال تھی۔ اس کی موت کی صحیح تاریخ غیر یقینی ہے۔ اہل سنت کا عقیدہ ہے کہ حضرت فاطمہ رضی اللہ عنہا کا انتقال حضرت محمد صلی اللہ علیہ وسلم کی وفات کے بعد غم سے ہوا۔\n\nتدفین:\u2000 ان کی وصیت پر عمل کرتے ہوئے حضرت علی رضی اللہ عنہ نے رات کو فاطمہ رضی اللہ عنہا کو چپکے سے دفن کیا اور ان کی تدفین کا منصوبہ چھپا دیا۔ خیال کیا جاتا ہے کہ فاطمہ (رضی اللہ عنہا) کی خواہش مسلمانوں کے عام رواج سے متصادم ہے، جنہیں جنازوں میں شامل ہونے کی ترغیب دی جاتی ہے۔\n',
  ];
  double _headingFontSize = 22.0;
  double _paragraphFontSize = 18.0;
  final pageController = PageController();
  @override
  Widget build(BuildContext context) {
    double width = MediaQuery.sizeOf(context).width;
    double height = MediaQuery.sizeOf(context).height;
    return Scaffold(
      body: Container(
        height: double.infinity,
        width: double.infinity,
        //decoration: buildBackgroundDecoration(),
        padding: const EdgeInsets.only(left: 10, right: 10, top: 30),
        child: Column(
          children: [
            const SizedBox(
              height: 2,
            ),
            buildHeadingContainer(widget.category == 'Birth And Childhood'
                ? 'پیدائش اور بچپن'
                : widget.category == 'Makki Life'
                ?'مکی زندگی': widget.category == 'Madni Life'
                ?'مدنی زندگی':widget.category == 'Parents'
                ?'Parents':widget.category == 'Wives'
                ?'Wives':widget.category == 'Children'
                ?'Children':widget.category == 'Miracles'
                ?'Miracles':'Battles',height*0.06,width*0.980),
            const SizedBox(
              height: 10,
            ),
            Container(
              height: height*0.805,
              width: width*0.980,
              decoration: const BoxDecoration(
                  //color: const Color(0xffDEDFF6).withOpacity(0.4),
                  borderRadius: BorderRadius.all(Radius.circular(10)),
                  boxShadow: [
                    BoxShadow(
                      //color: Colors.black,
                      blurRadius: 5,
                      spreadRadius: 1.4,
                      blurStyle: BlurStyle.outer,
                    ),
                  ]),
              //child: LargeTextPageView(),
              child: ListView.builder(
                  itemCount: widget.category == 'Birth And Childhood'
                      ? birthAndChildhoodUrduText.length
                      :  widget.category == 'Makki Life'
                      ? makkiLifeUrduText.length: widget.category == 'Madni Life'
                      ?madniLifeUrduText.length:widget.category == 'Parents'
                      ?parentsUrduText.length:widget.category == 'Wives'
                      ?wivesUrduText.length:childrenUrduText.length,
                  itemBuilder: (context, index) {
                    return Padding(
                      padding: const EdgeInsets.only(left: 8, right: 8),
                      child: Column(
                        children: [
                          Center(
                            child: Text(
                              widget.category == 'Birth And Childhood'
                                  ? birthAndChildhoodHeadings[index]
                                  :  widget.category == 'Makki Life'
                                  ? makkiLifeHeadings[index]: widget.category == 'Madni Life'
                                  ?madniLifeHeadings[index]:widget.category == 'Parents'
                                  ?parentsHeadings[index]:widget.category == 'Wives'
                                  ?wivesHeadings[index]:childrenHeadings[index],
                              style:  TextStyle(
                                  color: Colors.black,
                                  fontWeight: FontWeight.bold,
                                  fontSize: _headingFontSize,
                                  fontFamily: 'UrduFont',
                                  decoration: TextDecoration.underline),
                              textAlign: TextAlign.center,
                            ),
                          ),
                          const SizedBox(
                            height: 12,
                          ),
                          Text(
                            widget.category == 'Birth And Childhood'
                                ? birthAndChildhoodUrduText[index]
                                :  widget.category == 'Makki Life'
                                ? makkiLifeUrduText[index]: widget.category == 'Madni Life'
                                ?madniLifeUrduText[index]:widget.category == 'Parents'
                                ?parentsUrduText[index]:widget.category == 'Wives'
                                ?wivesUrduText[index]:childrenUrduText[index],
                            style:  TextStyle(
                              color: Colors.black,
                              fontWeight: FontWeight.bold,
                              fontSize: _paragraphFontSize,
                              fontFamily: 'UrduFont',
                            ),
                            textAlign: TextAlign.right,
                          ),
                        ],
                      ),
                    );
                  }),
            ),
            const SizedBox(height: 10,),
            Container(
              height: height*0.055,width:width*0.970,
              decoration: const BoxDecoration(
                  //color: const Color(0xffDEDFF6).withOpacity(0.4),
                  borderRadius: BorderRadius.all(Radius.circular(10)),

                  boxShadow: [
                    BoxShadow(
                      color: Colors.black,
                      blurRadius: 8,
                      spreadRadius: 2,
                      blurStyle: BlurStyle.outer,
                    ),
                  ]
              ),
              child:   Row(
                mainAxisAlignment: MainAxisAlignment.center,
                children: [
                  InkWell(
                    onTap: () => _showFontSizeMenu(context),
                    child: const Column(
                      children: [
                        Icon(Icons.font_download_outlined),
                        Text(
                          'Font Size',
                          style: TextStyle(
                              fontSize: 10, fontWeight: FontWeight.w700),
                        ),
                      ],
                    ),
                  ),
                  SizedBox(
                    width: width * 0.15,
                  ),
                  InkWell(
                    onTap: () {
                      _shareText();
                    },
                    child: const Column(
                      children: [
                        Icon(Icons.share),
                        Text(
                          'Share',
                          style: TextStyle(
                              fontSize: 10, fontWeight: FontWeight.w700),
                        ),
                      ],
                    ),
                  ),
                  SizedBox(
                    width: width * 0.15,
                  ),
                  InkWell(
                    onTap: () {
                      Navigator.pop(context);
                    },
                    child: Column(
                      children: [
                        const SizedBox(
                          height: 1.5,
                        ),
                        Image.asset(
                          'assets/language.png',
                          scale: 4,
                        ),
                        const Text(
                          'English',
                          style: TextStyle(
                              fontSize: 10, fontWeight: FontWeight.w700),
                        ),
                      ],
                    ),
                  ),
                  SizedBox(
                    width: width * 0.15,
                  ),
                  InkWell(
                    onTap: () {
                      Navigator.pop(context);
                    },
                    child: const Column(
                      children: [
                        Icon(Icons.arrow_back_ios_new_outlined),
                        Text(
                          'Back',
                          style: TextStyle(
                              fontSize: 10, fontWeight: FontWeight.w700),
                        ),
                      ],
                    ),
                  ),
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
  void _showFontSizeMenu(BuildContext context) {
    final RenderBox button = context.findRenderObject() as RenderBox;
    final RenderBox overlay = Overlay.of(context).context.findRenderObject() as RenderBox;

    showMenu<double>(
      //color:  const Color(0xffDEDFF6),
      context: context,
      position: RelativeRect.fromLTRB(
        button.localToGlobal(Offset.zero, ancestor: overlay).dx,
        button.localToGlobal(Offset.zero, ancestor: overlay).dy + button.size.height,
        button.localToGlobal(button.size.bottomRight(Offset.zero), ancestor: overlay).dx,
        button.localToGlobal(button.size.bottomRight(Offset.zero), ancestor: overlay).dy + button.size.height,
      ),
      items: [
        const PopupMenuItem(
          value: 22.0,
          child: Text('Small'),
        ),
        const PopupMenuItem(
          value: 26.0,
          child: Text('Medium'),
        ),
        const PopupMenuItem(
          value: 28.0,
          child: Text('Large'),
        ),
      ],
    ).then((value) {
      if (value != null) {
        setState(() {
          _headingFontSize = value;
          _paragraphFontSize = value - 4; // Adjust paragraph font size based on heading font size
        });
      }
    });
  }

  Container buildHeadingContainer(String urdHeading,double height,double width) {
    return Container(
        height: 46,
        width: 380,
        decoration: const BoxDecoration(
            //color: const Color(0xffDEDFF6).withOpacity(0.4),
            borderRadius: BorderRadius.all(Radius.circular(10)),
            boxShadow: [
              BoxShadow(
                color: Colors.black,
                blurRadius: 5,
                spreadRadius: 1.4,
                blurStyle: BlurStyle.outer,
              ),
            ]),
        child: Center(
          child: Text(
            urdHeading,
            style: const TextStyle(
                color: Colors.black,
                fontSize: 25,
                fontFamily: 'UrduFont',
                fontWeight: FontWeight.bold),
          ),
        ));
  }

  BoxDecoration buildBackgroundDecoration() {
    return BoxDecoration(
      gradient: LinearGradient(
        begin: Alignment.bottomLeft,
        end: Alignment.topRight,
        colors: [
          const Color(0xff2C34F1).withOpacity(0.2),
          const Color(0xff8F94FE).withOpacity(0.2),
          const Color(0xff4950E7).withOpacity(0.2),
          const Color(0xff9295EE).withOpacity(0.2),
          const Color(0xff141DFA).withOpacity(0.2),
        ],
      ),
      //borderRadius: BorderRadius.only(topRight: Radius.circular(15),topLeft: Radius.circular(15)),
    );
  }
  void _shareText() {
    String textToShare = '';
    int length = widget.category == 'Birth And Childhood'
        ? birthAndChildhoodHeadings.length
        : widget.category == 'Makki Life'
        ?makkiLifeHeadings.length:widget.category == 'Madni Life'
        ?madniLifeHeadings.length:widget.category == 'Parents'
        ?parentsHeadings.length:widget.category == 'Wives'
        ?wivesHeadings.length:childrenHeadings.length;
    for (int i = 0; i < length; i++) {
      textToShare += widget.category == 'Birth And Childhood'
          ? '${birthAndChildhoodHeadings[i]}\n\n${birthAndChildhoodUrduText[i]}\n'
          : widget.category == 'Makki Life'
          ?'${makkiLifeHeadings[i]}\n\n${makkiLifeUrduText[i]}\n':widget.category == 'Madni Life'
          ?'${madniLifeHeadings[i]}\n\n${madniLifeUrduText[i]}\n':widget.category == 'Parents'
          ?'${parentsHeadings[i]}\n\n${parentsUrduText[i]}\n':widget.category == 'Wives'
          ?'${wivesHeadings[i]}\n\n${wivesUrduText[i]}\n':'${childrenHeadings[i]}\n\n${childrenUrduText[i]}\n';
    }
    Share.share(textToShare);
  }
}
